7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_CAN.h
#define Get_CAN3_MCR(FLAG)                   (*(uint32_t*)0x40003400 |= FLAG)
#define Get_CAN3_MSR(FLAG)                   (*(uint32_t*)0x40003404 |= FLAG)
#define Get_CAN3_TSR(FLAG)                   (*(uint32_t*)0x40003408 |= FLAG)
#define Get_CAN3_RF0R(FLAG)                  (*(uint32_t*)0x4000340c |= FLAG)
#define Get_CAN3_RF1R(FLAG)                  (*(uint32_t*)0x40003410 |= FLAG)
#define Get_CAN3_IER(FLAG)                   (*(uint32_t*)0x40003414 |= FLAG)
#define Get_CAN3_ESR(FLAG)                   (*(uint32_t*)0x40003418 |= FLAG)
#define Get_CAN3_BTR(FLAG)                   (*(uint32_t*)0x4000341c |= FLAG)
#define Get_CAN3_TI0R(FLAG)                  (*(uint32_t*)0x40003580 |= FLAG)
#define Get_CAN3_TDT0R(FLAG)                 (*(uint32_t*)0x40003584 |= FLAG)
#define Get_CAN3_TDL0R(FLAG)                 (*(uint32_t*)0x40003588 |= FLAG)
#define Get_CAN3_TDH0R(FLAG)                 (*(uint32_t*)0x4000358c |= FLAG)
#define Get_CAN3_TI1R(FLAG)                  (*(uint32_t*)0x40003590 |= FLAG)
#define Get_CAN3_TDT1R(FLAG)                 (*(uint32_t*)0x40003594 |= FLAG)
#define Get_CAN3_TDL1R(FLAG)                 (*(uint32_t*)0x40003598 |= FLAG)
#define Get_CAN3_TDH1R(FLAG)                 (*(uint32_t*)0x4000359c |= FLAG)
#define Get_CAN3_TI2R(FLAG)                  (*(uint32_t*)0x400035a0 |= FLAG)
#define Get_CAN3_TDT2R(FLAG)                 (*(uint32_t*)0x400035a4 |= FLAG)
#define Get_CAN3_TDL2R(FLAG)                 (*(uint32_t*)0x400035a8 |= FLAG)
#define Get_CAN3_TDH2R(FLAG)                 (*(uint32_t*)0x400035ac |= FLAG)
#define Get_CAN3_RI0R(FLAG)                  (*(uint32_t*)0x400035b0 |= FLAG)
#define Get_CAN3_RDT0R(FLAG)                 (*(uint32_t*)0x400035b4 |= FLAG)
#define Get_CAN3_RDL0R(FLAG)                 (*(uint32_t*)0x400035b8 |= FLAG)
#define Get_CAN3_RDH0R(FLAG)                 (*(uint32_t*)0x400035bc |= FLAG)
#define Get_CAN3_RI1R(FLAG)                  (*(uint32_t*)0x400035c0 |= FLAG)
#define Get_CAN3_RDT1R(FLAG)                 (*(uint32_t*)0x400035c4 |= FLAG)
#define Get_CAN3_RDL1R(FLAG)                 (*(uint32_t*)0x400035c8 |= FLAG)
#define Get_CAN3_RDH1R(FLAG)                 (*(uint32_t*)0x400035cc |= FLAG)
#define Get_CAN3_FMR(FLAG)                   (*(uint32_t*)0x40003600 |= FLAG)
#define Get_CAN3_FM1R(FLAG)                  (*(uint32_t*)0x40003604 |= FLAG)
#define Get_CAN3_FS1R(FLAG)                  (*(uint32_t*)0x4000360c |= FLAG)
#define Get_CAN3_FFA1R(FLAG)                 (*(uint32_t*)0x40003614 |= FLAG)
#define Get_CAN3_FA1R(FLAG)                  (*(uint32_t*)0x4000361c |= FLAG)
#define Get_CAN3_F0R1(FLAG)                  (*(uint32_t*)0x40003640 |= FLAG)
#define Get_CAN3_F0R2(FLAG)                  (*(uint32_t*)0x40003644 |= FLAG)
#define Get_CAN3_F1R1(FLAG)                  (*(uint32_t*)0x40003648 |= FLAG)
#define Get_CAN3_F1R2(FLAG)                  (*(uint32_t*)0x4000364c |= FLAG)
#define Get_CAN3_F2R1(FLAG)                  (*(uint32_t*)0x40003650 |= FLAG)
#define Get_CAN3_F2R2(FLAG)                  (*(uint32_t*)0x40003654 |= FLAG)
#define Get_CAN3_F3R1(FLAG)                  (*(uint32_t*)0x40003658 |= FLAG)
#define Get_CAN3_F3R2(FLAG)                  (*(uint32_t*)0x4000365c |= FLAG)
#define Get_CAN3_F4R1(FLAG)                  (*(uint32_t*)0x40003660 |= FLAG)
#define Get_CAN3_F4R2(FLAG)                  (*(uint32_t*)0x40003664 |= FLAG)
#define Get_CAN3_F5R1(FLAG)                  (*(uint32_t*)0x40003668 |= FLAG)
#define Get_CAN3_F5R2(FLAG)                  (*(uint32_t*)0x4000366c |= FLAG)
#define Get_CAN3_F6R1(FLAG)                  (*(uint32_t*)0x40003670 |= FLAG)
#define Get_CAN3_F6R2(FLAG)                  (*(uint32_t*)0x40003674 |= FLAG)
#define Get_CAN3_F7R1(FLAG)                  (*(uint32_t*)0x40003678 |= FLAG)
#define Get_CAN3_F7R2(FLAG)                  (*(uint32_t*)0x4000367c |= FLAG)
#define Get_CAN3_F8R1(FLAG)                  (*(uint32_t*)0x40003680 |= FLAG)
#define Get_CAN3_F8R2(FLAG)                  (*(uint32_t*)0x40003684 |= FLAG)
#define Get_CAN3_F9R1(FLAG)                  (*(uint32_t*)0x40003688 |= FLAG)
#define Get_CAN3_F9R2(FLAG)                  (*(uint32_t*)0x4000368c |= FLAG)
#define Get_CAN3_F10R1(FLAG)                 (*(uint32_t*)0x40003690 |= FLAG)
#define Get_CAN3_F10R2(FLAG)                 (*(uint32_t*)0x40003694 |= FLAG)
#define Get_CAN3_F11R1(FLAG)                 (*(uint32_t*)0x40003698 |= FLAG)
#define Get_CAN3_F11R2(FLAG)                 (*(uint32_t*)0x4000369c |= FLAG)
#define Get_CAN3_F12R1(FLAG)                 (*(uint32_t*)0x400036a0 |= FLAG)
#define Get_CAN3_F12R2(FLAG)                 (*(uint32_t*)0x400036a4 |= FLAG)
#define Get_CAN3_F13R1(FLAG)                 (*(uint32_t*)0x400036a8 |= FLAG)
#define Get_CAN3_F13R2(FLAG)                 (*(uint32_t*)0x400036ac |= FLAG)
#define Get_CAN3_F14R1(FLAG)                 (*(uint32_t*)0x400036b0 |= FLAG)
#define Get_CAN3_F14R2(FLAG)                 (*(uint32_t*)0x400036b4 |= FLAG)
#define Get_CAN3_F15R1(FLAG)                 (*(uint32_t*)0x400036b8 |= FLAG)
#define Get_CAN3_F15R2(FLAG)                 (*(uint32_t*)0x400036bc |= FLAG)
#define Get_CAN3_F16R1(FLAG)                 (*(uint32_t*)0x400036c0 |= FLAG)
#define Get_CAN3_F16R2(FLAG)                 (*(uint32_t*)0x400036c4 |= FLAG)
#define Get_CAN3_F17R1(FLAG)                 (*(uint32_t*)0x400036c8 |= FLAG)
#define Get_CAN3_F17R2(FLAG)                 (*(uint32_t*)0x400036cc |= FLAG)
#define Get_CAN3_F18R1(FLAG)                 (*(uint32_t*)0x400036d0 |= FLAG)
#define Get_CAN3_F18R2(FLAG)                 (*(uint32_t*)0x400036d4 |= FLAG)
#define Get_CAN3_F19R1(FLAG)                 (*(uint32_t*)0x400036d8 |= FLAG)
#define Get_CAN3_F19R2(FLAG)                 (*(uint32_t*)0x400036dc |= FLAG)
#define Get_CAN3_F20R1(FLAG)                 (*(uint32_t*)0x400036e0 |= FLAG)
#define Get_CAN3_F20R2(FLAG)                 (*(uint32_t*)0x400036e4 |= FLAG)
#define Get_CAN3_F21R1(FLAG)                 (*(uint32_t*)0x400036e8 |= FLAG)
#define Get_CAN3_F21R2(FLAG)                 (*(uint32_t*)0x400036ec |= FLAG)
#define Get_CAN3_F22R1(FLAG)                 (*(uint32_t*)0x400036f0 |= FLAG)
#define Get_CAN3_F22R2(FLAG)                 (*(uint32_t*)0x400036f4 |= FLAG)
#define Get_CAN3_F23R1(FLAG)                 (*(uint32_t*)0x400036f8 |= FLAG)
#define Get_CAN3_F23R2(FLAG)                 (*(uint32_t*)0x400036fc |= FLAG)
#define Get_CAN3_F24R1(FLAG)                 (*(uint32_t*)0x40003700 |= FLAG)
#define Get_CAN3_F24R2(FLAG)                 (*(uint32_t*)0x40003704 |= FLAG)
#define Get_CAN3_F25R1(FLAG)                 (*(uint32_t*)0x40003708 |= FLAG)
#define Get_CAN3_F25R2(FLAG)                 (*(uint32_t*)0x4000370c |= FLAG)
#define Get_CAN3_F26R1(FLAG)                 (*(uint32_t*)0x40003710 |= FLAG)
#define Get_CAN3_F26R2(FLAG)                 (*(uint32_t*)0x40003714 |= FLAG)
#define Get_CAN3_F27R1(FLAG)                 (*(uint32_t*)0x40003718 |= FLAG)
#define Get_CAN3_F27R2(FLAG)                 (*(uint32_t*)0x4000371c |= FLAG)
#define Get_CAN1_MCR(FLAG)                   (*(uint32_t*)0x40006400 |= FLAG)
#define Get_CAN1_MSR(FLAG)                   (*(uint32_t*)0x40006404 |= FLAG)
#define Get_CAN1_TSR(FLAG)                   (*(uint32_t*)0x40006408 |= FLAG)
#define Get_CAN1_RF0R(FLAG)                  (*(uint32_t*)0x4000640c |= FLAG)
#define Get_CAN1_RF1R(FLAG)                  (*(uint32_t*)0x40006410 |= FLAG)
#define Get_CAN1_IER(FLAG)                   (*(uint32_t*)0x40006414 |= FLAG)
#define Get_CAN1_ESR(FLAG)                   (*(uint32_t*)0x40006418 |= FLAG)
#define Get_CAN1_BTR(FLAG)                   (*(uint32_t*)0x4000641c |= FLAG)
#define Get_CAN1_TI0R(FLAG)                  (*(uint32_t*)0x40006580 |= FLAG)
#define Get_CAN1_TDT0R(FLAG)                 (*(uint32_t*)0x40006584 |= FLAG)
#define Get_CAN1_TDL0R(FLAG)                 (*(uint32_t*)0x40006588 |= FLAG)
#define Get_CAN1_TDH0R(FLAG)                 (*(uint32_t*)0x4000658c |= FLAG)
#define Get_CAN1_TI1R(FLAG)                  (*(uint32_t*)0x40006590 |= FLAG)
#define Get_CAN1_TDT1R(FLAG)                 (*(uint32_t*)0x40006594 |= FLAG)
#define Get_CAN1_TDL1R(FLAG)                 (*(uint32_t*)0x40006598 |= FLAG)
#define Get_CAN1_TDH1R(FLAG)                 (*(uint32_t*)0x4000659c |= FLAG)
#define Get_CAN1_TI2R(FLAG)                  (*(uint32_t*)0x400065a0 |= FLAG)
#define Get_CAN1_TDT2R(FLAG)                 (*(uint32_t*)0x400065a4 |= FLAG)
#define Get_CAN1_TDL2R(FLAG)                 (*(uint32_t*)0x400065a8 |= FLAG)
#define Get_CAN1_TDH2R(FLAG)                 (*(uint32_t*)0x400065ac |= FLAG)
#define Get_CAN1_RI0R(FLAG)                  (*(uint32_t*)0x400065b0 |= FLAG)
#define Get_CAN1_RDT0R(FLAG)                 (*(uint32_t*)0x400065b4 |= FLAG)
#define Get_CAN1_RDL0R(FLAG)                 (*(uint32_t*)0x400065b8 |= FLAG)
#define Get_CAN1_RDH0R(FLAG)                 (*(uint32_t*)0x400065bc |= FLAG)
#define Get_CAN1_RI1R(FLAG)                  (*(uint32_t*)0x400065c0 |= FLAG)
#define Get_CAN1_RDT1R(FLAG)                 (*(uint32_t*)0x400065c4 |= FLAG)
#define Get_CAN1_RDL1R(FLAG)                 (*(uint32_t*)0x400065c8 |= FLAG)
#define Get_CAN1_RDH1R(FLAG)                 (*(uint32_t*)0x400065cc |= FLAG)
#define Get_CAN1_FMR(FLAG)                   (*(uint32_t*)0x40006600 |= FLAG)
#define Get_CAN1_FM1R(FLAG)                  (*(uint32_t*)0x40006604 |= FLAG)
#define Get_CAN1_FS1R(FLAG)                  (*(uint32_t*)0x4000660c |= FLAG)
#define Get_CAN1_FFA1R(FLAG)                 (*(uint32_t*)0x40006614 |= FLAG)
#define Get_CAN1_FA1R(FLAG)                  (*(uint32_t*)0x4000661c |= FLAG)
#define Get_CAN1_F0R1(FLAG)                  (*(uint32_t*)0x40006640 |= FLAG)
#define Get_CAN1_F0R2(FLAG)                  (*(uint32_t*)0x40006644 |= FLAG)
#define Get_CAN1_F1R1(FLAG)                  (*(uint32_t*)0x40006648 |= FLAG)
#define Get_CAN1_F1R2(FLAG)                  (*(uint32_t*)0x4000664c |= FLAG)
#define Get_CAN1_F2R1(FLAG)                  (*(uint32_t*)0x40006650 |= FLAG)
#define Get_CAN1_F2R2(FLAG)                  (*(uint32_t*)0x40006654 |= FLAG)
#define Get_CAN1_F3R1(FLAG)                  (*(uint32_t*)0x40006658 |= FLAG)
#define Get_CAN1_F3R2(FLAG)                  (*(uint32_t*)0x4000665c |= FLAG)
#define Get_CAN1_F4R1(FLAG)                  (*(uint32_t*)0x40006660 |= FLAG)
#define Get_CAN1_F4R2(FLAG)                  (*(uint32_t*)0x40006664 |= FLAG)
#define Get_CAN1_F5R1(FLAG)                  (*(uint32_t*)0x40006668 |= FLAG)
#define Get_CAN1_F5R2(FLAG)                  (*(uint32_t*)0x4000666c |= FLAG)
#define Get_CAN1_F6R1(FLAG)                  (*(uint32_t*)0x40006670 |= FLAG)
#define Get_CAN1_F6R2(FLAG)                  (*(uint32_t*)0x40006674 |= FLAG)
#define Get_CAN1_F7R1(FLAG)                  (*(uint32_t*)0x40006678 |= FLAG)
#define Get_CAN1_F7R2(FLAG)                  (*(uint32_t*)0x4000667c |= FLAG)
#define Get_CAN1_F8R1(FLAG)                  (*(uint32_t*)0x40006680 |= FLAG)
#define Get_CAN1_F8R2(FLAG)                  (*(uint32_t*)0x40006684 |= FLAG)
#define Get_CAN1_F9R1(FLAG)                  (*(uint32_t*)0x40006688 |= FLAG)
#define Get_CAN1_F9R2(FLAG)                  (*(uint32_t*)0x4000668c |= FLAG)
#define Get_CAN1_F10R1(FLAG)                 (*(uint32_t*)0x40006690 |= FLAG)
#define Get_CAN1_F10R2(FLAG)                 (*(uint32_t*)0x40006694 |= FLAG)
#define Get_CAN1_F11R1(FLAG)                 (*(uint32_t*)0x40006698 |= FLAG)
#define Get_CAN1_F11R2(FLAG)                 (*(uint32_t*)0x4000669c |= FLAG)
#define Get_CAN1_F12R1(FLAG)                 (*(uint32_t*)0x400066a0 |= FLAG)
#define Get_CAN1_F12R2(FLAG)                 (*(uint32_t*)0x400066a4 |= FLAG)
#define Get_CAN1_F13R1(FLAG)                 (*(uint32_t*)0x400066a8 |= FLAG)
#define Get_CAN1_F13R2(FLAG)                 (*(uint32_t*)0x400066ac |= FLAG)
#define Get_CAN1_F14R1(FLAG)                 (*(uint32_t*)0x400066b0 |= FLAG)
#define Get_CAN1_F14R2(FLAG)                 (*(uint32_t*)0x400066b4 |= FLAG)
#define Get_CAN1_F15R1(FLAG)                 (*(uint32_t*)0x400066b8 |= FLAG)
#define Get_CAN1_F15R2(FLAG)                 (*(uint32_t*)0x400066bc |= FLAG)
#define Get_CAN1_F16R1(FLAG)                 (*(uint32_t*)0x400066c0 |= FLAG)
#define Get_CAN1_F16R2(FLAG)                 (*(uint32_t*)0x400066c4 |= FLAG)
#define Get_CAN1_F17R1(FLAG)                 (*(uint32_t*)0x400066c8 |= FLAG)
#define Get_CAN1_F17R2(FLAG)                 (*(uint32_t*)0x400066cc |= FLAG)
#define Get_CAN1_F18R1(FLAG)                 (*(uint32_t*)0x400066d0 |= FLAG)
#define Get_CAN1_F18R2(FLAG)                 (*(uint32_t*)0x400066d4 |= FLAG)
#define Get_CAN1_F19R1(FLAG)                 (*(uint32_t*)0x400066d8 |= FLAG)
#define Get_CAN1_F19R2(FLAG)                 (*(uint32_t*)0x400066dc |= FLAG)
#define Get_CAN1_F20R1(FLAG)                 (*(uint32_t*)0x400066e0 |= FLAG)
#define Get_CAN1_F20R2(FLAG)                 (*(uint32_t*)0x400066e4 |= FLAG)
#define Get_CAN1_F21R1(FLAG)                 (*(uint32_t*)0x400066e8 |= FLAG)
#define Get_CAN1_F21R2(FLAG)                 (*(uint32_t*)0x400066ec |= FLAG)
#define Get_CAN1_F22R1(FLAG)                 (*(uint32_t*)0x400066f0 |= FLAG)
#define Get_CAN1_F22R2(FLAG)                 (*(uint32_t*)0x400066f4 |= FLAG)
#define Get_CAN1_F23R1(FLAG)                 (*(uint32_t*)0x400066f8 |= FLAG)
#define Get_CAN1_F23R2(FLAG)                 (*(uint32_t*)0x400066fc |= FLAG)
#define Get_CAN1_F24R1(FLAG)                 (*(uint32_t*)0x40006700 |= FLAG)
#define Get_CAN1_F24R2(FLAG)                 (*(uint32_t*)0x40006704 |= FLAG)
#define Get_CAN1_F25R1(FLAG)                 (*(uint32_t*)0x40006708 |= FLAG)
#define Get_CAN1_F25R2(FLAG)                 (*(uint32_t*)0x4000670c |= FLAG)
#define Get_CAN1_F26R1(FLAG)                 (*(uint32_t*)0x40006710 |= FLAG)
#define Get_CAN1_F26R2(FLAG)                 (*(uint32_t*)0x40006714 |= FLAG)
#define Get_CAN1_F27R1(FLAG)                 (*(uint32_t*)0x40006718 |= FLAG)
#define Get_CAN1_F27R2(FLAG)                 (*(uint32_t*)0x4000671c |= FLAG)
#define Get_CAN2_MCR(FLAG)                   (*(uint32_t*)0x40006800 |= FLAG)
#define Get_CAN2_MSR(FLAG)                   (*(uint32_t*)0x40006804 |= FLAG)
#define Get_CAN2_TSR(FLAG)                   (*(uint32_t*)0x40006808 |= FLAG)
#define Get_CAN2_RF0R(FLAG)                  (*(uint32_t*)0x4000680c |= FLAG)
#define Get_CAN2_RF1R(FLAG)                  (*(uint32_t*)0x40006810 |= FLAG)
#define Get_CAN2_IER(FLAG)                   (*(uint32_t*)0x40006814 |= FLAG)
#define Get_CAN2_ESR(FLAG)                   (*(uint32_t*)0x40006818 |= FLAG)
#define Get_CAN2_BTR(FLAG)                   (*(uint32_t*)0x4000681c |= FLAG)
#define Get_CAN2_TI0R(FLAG)                  (*(uint32_t*)0x40006980 |= FLAG)
#define Get_CAN2_TDT0R(FLAG)                 (*(uint32_t*)0x40006984 |= FLAG)
#define Get_CAN2_TDL0R(FLAG)                 (*(uint32_t*)0x40006988 |= FLAG)
#define Get_CAN2_TDH0R(FLAG)                 (*(uint32_t*)0x4000698c |= FLAG)
#define Get_CAN2_TI1R(FLAG)                  (*(uint32_t*)0x40006990 |= FLAG)
#define Get_CAN2_TDT1R(FLAG)                 (*(uint32_t*)0x40006994 |= FLAG)
#define Get_CAN2_TDL1R(FLAG)                 (*(uint32_t*)0x40006998 |= FLAG)
#define Get_CAN2_TDH1R(FLAG)                 (*(uint32_t*)0x4000699c |= FLAG)
#define Get_CAN2_TI2R(FLAG)                  (*(uint32_t*)0x400069a0 |= FLAG)
#define Get_CAN2_TDT2R(FLAG)                 (*(uint32_t*)0x400069a4 |= FLAG)
#define Get_CAN2_TDL2R(FLAG)                 (*(uint32_t*)0x400069a8 |= FLAG)
#define Get_CAN2_TDH2R(FLAG)                 (*(uint32_t*)0x400069ac |= FLAG)
#define Get_CAN2_RI0R(FLAG)                  (*(uint32_t*)0x400069b0 |= FLAG)
#define Get_CAN2_RDT0R(FLAG)                 (*(uint32_t*)0x400069b4 |= FLAG)
#define Get_CAN2_RDL0R(FLAG)                 (*(uint32_t*)0x400069b8 |= FLAG)
#define Get_CAN2_RDH0R(FLAG)                 (*(uint32_t*)0x400069bc |= FLAG)
#define Get_CAN2_RI1R(FLAG)                  (*(uint32_t*)0x400069c0 |= FLAG)
#define Get_CAN2_RDT1R(FLAG)                 (*(uint32_t*)0x400069c4 |= FLAG)
#define Get_CAN2_RDL1R(FLAG)                 (*(uint32_t*)0x400069c8 |= FLAG)
#define Get_CAN2_RDH1R(FLAG)                 (*(uint32_t*)0x400069cc |= FLAG)
#define Get_CAN2_FMR(FLAG)                   (*(uint32_t*)0x40006a00 |= FLAG)
#define Get_CAN2_FM1R(FLAG)                  (*(uint32_t*)0x40006a04 |= FLAG)
#define Get_CAN2_FS1R(FLAG)                  (*(uint32_t*)0x40006a0c |= FLAG)
#define Get_CAN2_FFA1R(FLAG)                 (*(uint32_t*)0x40006a14 |= FLAG)
#define Get_CAN2_FA1R(FLAG)                  (*(uint32_t*)0x40006a1c |= FLAG)
#define Get_CAN2_F0R1(FLAG)                  (*(uint32_t*)0x40006a40 |= FLAG)
#define Get_CAN2_F0R2(FLAG)                  (*(uint32_t*)0x40006a44 |= FLAG)
#define Get_CAN2_F1R1(FLAG)                  (*(uint32_t*)0x40006a48 |= FLAG)
#define Get_CAN2_F1R2(FLAG)                  (*(uint32_t*)0x40006a4c |= FLAG)
#define Get_CAN2_F2R1(FLAG)                  (*(uint32_t*)0x40006a50 |= FLAG)
#define Get_CAN2_F2R2(FLAG)                  (*(uint32_t*)0x40006a54 |= FLAG)
#define Get_CAN2_F3R1(FLAG)                  (*(uint32_t*)0x40006a58 |= FLAG)
#define Get_CAN2_F3R2(FLAG)                  (*(uint32_t*)0x40006a5c |= FLAG)
#define Get_CAN2_F4R1(FLAG)                  (*(uint32_t*)0x40006a60 |= FLAG)
#define Get_CAN2_F4R2(FLAG)                  (*(uint32_t*)0x40006a64 |= FLAG)
#define Get_CAN2_F5R1(FLAG)                  (*(uint32_t*)0x40006a68 |= FLAG)
#define Get_CAN2_F5R2(FLAG)                  (*(uint32_t*)0x40006a6c |= FLAG)
#define Get_CAN2_F6R1(FLAG)                  (*(uint32_t*)0x40006a70 |= FLAG)
#define Get_CAN2_F6R2(FLAG)                  (*(uint32_t*)0x40006a74 |= FLAG)
#define Get_CAN2_F7R1(FLAG)                  (*(uint32_t*)0x40006a78 |= FLAG)
#define Get_CAN2_F7R2(FLAG)                  (*(uint32_t*)0x40006a7c |= FLAG)
#define Get_CAN2_F8R1(FLAG)                  (*(uint32_t*)0x40006a80 |= FLAG)
#define Get_CAN2_F8R2(FLAG)                  (*(uint32_t*)0x40006a84 |= FLAG)
#define Get_CAN2_F9R1(FLAG)                  (*(uint32_t*)0x40006a88 |= FLAG)
#define Get_CAN2_F9R2(FLAG)                  (*(uint32_t*)0x40006a8c |= FLAG)
#define Get_CAN2_F10R1(FLAG)                 (*(uint32_t*)0x40006a90 |= FLAG)
#define Get_CAN2_F10R2(FLAG)                 (*(uint32_t*)0x40006a94 |= FLAG)
#define Get_CAN2_F11R1(FLAG)                 (*(uint32_t*)0x40006a98 |= FLAG)
#define Get_CAN2_F11R2(FLAG)                 (*(uint32_t*)0x40006a9c |= FLAG)
#define Get_CAN2_F12R1(FLAG)                 (*(uint32_t*)0x40006aa0 |= FLAG)
#define Get_CAN2_F12R2(FLAG)                 (*(uint32_t*)0x40006aa4 |= FLAG)
#define Get_CAN2_F13R1(FLAG)                 (*(uint32_t*)0x40006aa8 |= FLAG)
#define Get_CAN2_F13R2(FLAG)                 (*(uint32_t*)0x40006aac |= FLAG)
#define Get_CAN2_F14R1(FLAG)                 (*(uint32_t*)0x40006ab0 |= FLAG)
#define Get_CAN2_F14R2(FLAG)                 (*(uint32_t*)0x40006ab4 |= FLAG)
#define Get_CAN2_F15R1(FLAG)                 (*(uint32_t*)0x40006ab8 |= FLAG)
#define Get_CAN2_F15R2(FLAG)                 (*(uint32_t*)0x40006abc |= FLAG)
#define Get_CAN2_F16R1(FLAG)                 (*(uint32_t*)0x40006ac0 |= FLAG)
#define Get_CAN2_F16R2(FLAG)                 (*(uint32_t*)0x40006ac4 |= FLAG)
#define Get_CAN2_F17R1(FLAG)                 (*(uint32_t*)0x40006ac8 |= FLAG)
#define Get_CAN2_F17R2(FLAG)                 (*(uint32_t*)0x40006acc |= FLAG)
#define Get_CAN2_F18R1(FLAG)                 (*(uint32_t*)0x40006ad0 |= FLAG)
#define Get_CAN2_F18R2(FLAG)                 (*(uint32_t*)0x40006ad4 |= FLAG)
#define Get_CAN2_F19R1(FLAG)                 (*(uint32_t*)0x40006ad8 |= FLAG)
#define Get_CAN2_F19R2(FLAG)                 (*(uint32_t*)0x40006adc |= FLAG)
#define Get_CAN2_F20R1(FLAG)                 (*(uint32_t*)0x40006ae0 |= FLAG)
#define Get_CAN2_F20R2(FLAG)                 (*(uint32_t*)0x40006ae4 |= FLAG)
#define Get_CAN2_F21R1(FLAG)                 (*(uint32_t*)0x40006ae8 |= FLAG)
#define Get_CAN2_F21R2(FLAG)                 (*(uint32_t*)0x40006aec |= FLAG)
#define Get_CAN2_F22R1(FLAG)                 (*(uint32_t*)0x40006af0 |= FLAG)
#define Get_CAN2_F22R2(FLAG)                 (*(uint32_t*)0x40006af4 |= FLAG)
#define Get_CAN2_F23R1(FLAG)                 (*(uint32_t*)0x40006af8 |= FLAG)
#define Get_CAN2_F23R2(FLAG)                 (*(uint32_t*)0x40006afc |= FLAG)
#define Get_CAN2_F24R1(FLAG)                 (*(uint32_t*)0x40006b00 |= FLAG)
#define Get_CAN2_F24R2(FLAG)                 (*(uint32_t*)0x40006b04 |= FLAG)
#define Get_CAN2_F25R1(FLAG)                 (*(uint32_t*)0x40006b08 |= FLAG)
#define Get_CAN2_F25R2(FLAG)                 (*(uint32_t*)0x40006b0c |= FLAG)
#define Get_CAN2_F26R1(FLAG)                 (*(uint32_t*)0x40006b10 |= FLAG)
#define Get_CAN2_F26R2(FLAG)                 (*(uint32_t*)0x40006b14 |= FLAG)
#define Get_CAN2_F27R1(FLAG)                 (*(uint32_t*)0x40006b18 |= FLAG)
#define Get_CAN2_F27R2(FLAG)                 (*(uint32_t*)0x40006b1c |= FLAG)
#define Set_CAN3_MCR(FLAG)                   (*(uint32_t*)0x40003400 &= FLAG)
#define Clr_CAN3_MCR(FLAG)                   (*(uint32_t*)0x40003400 |= ~FLAG)
#define Set_CAN3_MSR(FLAG)                   (*(uint32_t*)0x40003404 &= FLAG)
#define Clr_CAN3_MSR(FLAG)                   (*(uint32_t*)0x40003404 |= ~FLAG)
#define Set_CAN3_TSR(FLAG)                   (*(uint32_t*)0x40003408 &= FLAG)
#define Clr_CAN3_TSR(FLAG)                   (*(uint32_t*)0x40003408 |= ~FLAG)
#define Set_CAN3_RF0R(FLAG)                  (*(uint32_t*)0x4000340c &= FLAG)
#define Clr_CAN3_RF0R(FLAG)                  (*(uint32_t*)0x4000340c |= ~FLAG)
#define Set_CAN3_RF1R(FLAG)                  (*(uint32_t*)0x40003410 &= FLAG)
#define Clr_CAN3_RF1R(FLAG)                  (*(uint32_t*)0x40003410 |= ~FLAG)
#define Set_CAN3_IER(FLAG)                   (*(uint32_t*)0x40003414 &= FLAG)
#define Clr_CAN3_IER(FLAG)                   (*(uint32_t*)0x40003414 |= ~FLAG)
#define Set_CAN3_ESR(FLAG)                   (*(uint32_t*)0x40003418 &= FLAG)
#define Clr_CAN3_ESR(FLAG)                   (*(uint32_t*)0x40003418 |= ~FLAG)
#define Set_CAN3_BTR(FLAG)                   (*(uint32_t*)0x4000341c &= FLAG)
#define Clr_CAN3_BTR(FLAG)                   (*(uint32_t*)0x4000341c |= ~FLAG)
#define Set_CAN3_TI0R(FLAG)                  (*(uint32_t*)0x40003580 &= FLAG)
#define Clr_CAN3_TI0R(FLAG)                  (*(uint32_t*)0x40003580 |= ~FLAG)
#define Set_CAN3_TDT0R(FLAG)                 (*(uint32_t*)0x40003584 &= FLAG)
#define Clr_CAN3_TDT0R(FLAG)                 (*(uint32_t*)0x40003584 |= ~FLAG)
#define Set_CAN3_TDL0R(FLAG)                 (*(uint32_t*)0x40003588 &= FLAG)
#define Clr_CAN3_TDL0R(FLAG)                 (*(uint32_t*)0x40003588 |= ~FLAG)
#define Set_CAN3_TDH0R(FLAG)                 (*(uint32_t*)0x4000358c &= FLAG)
#define Clr_CAN3_TDH0R(FLAG)                 (*(uint32_t*)0x4000358c |= ~FLAG)
#define Set_CAN3_TI1R(FLAG)                  (*(uint32_t*)0x40003590 &= FLAG)
#define Clr_CAN3_TI1R(FLAG)                  (*(uint32_t*)0x40003590 |= ~FLAG)
#define Set_CAN3_TDT1R(FLAG)                 (*(uint32_t*)0x40003594 &= FLAG)
#define Clr_CAN3_TDT1R(FLAG)                 (*(uint32_t*)0x40003594 |= ~FLAG)
#define Set_CAN3_TDL1R(FLAG)                 (*(uint32_t*)0x40003598 &= FLAG)
#define Clr_CAN3_TDL1R(FLAG)                 (*(uint32_t*)0x40003598 |= ~FLAG)
#define Set_CAN3_TDH1R(FLAG)                 (*(uint32_t*)0x4000359c &= FLAG)
#define Clr_CAN3_TDH1R(FLAG)                 (*(uint32_t*)0x4000359c |= ~FLAG)
#define Set_CAN3_TI2R(FLAG)                  (*(uint32_t*)0x400035a0 &= FLAG)
#define Clr_CAN3_TI2R(FLAG)                  (*(uint32_t*)0x400035a0 |= ~FLAG)
#define Set_CAN3_TDT2R(FLAG)                 (*(uint32_t*)0x400035a4 &= FLAG)
#define Clr_CAN3_TDT2R(FLAG)                 (*(uint32_t*)0x400035a4 |= ~FLAG)
#define Set_CAN3_TDL2R(FLAG)                 (*(uint32_t*)0x400035a8 &= FLAG)
#define Clr_CAN3_TDL2R(FLAG)                 (*(uint32_t*)0x400035a8 |= ~FLAG)
#define Set_CAN3_TDH2R(FLAG)                 (*(uint32_t*)0x400035ac &= FLAG)
#define Clr_CAN3_TDH2R(FLAG)                 (*(uint32_t*)0x400035ac |= ~FLAG)
