7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_CAN.h
#define Set_CAN3_RI0R(FLAG)                  (*(uint32_t*)0x400035b0 &= FLAG)
#define Clr_CAN3_RI0R(FLAG)                  (*(uint32_t*)0x400035b0 |= ~FLAG)
#define Set_CAN3_RDT0R(FLAG)                 (*(uint32_t*)0x400035b4 &= FLAG)
#define Clr_CAN3_RDT0R(FLAG)                 (*(uint32_t*)0x400035b4 |= ~FLAG)
#define Set_CAN3_RDL0R(FLAG)                 (*(uint32_t*)0x400035b8 &= FLAG)
#define Clr_CAN3_RDL0R(FLAG)                 (*(uint32_t*)0x400035b8 |= ~FLAG)
#define Set_CAN3_RDH0R(FLAG)                 (*(uint32_t*)0x400035bc &= FLAG)
#define Clr_CAN3_RDH0R(FLAG)                 (*(uint32_t*)0x400035bc |= ~FLAG)
#define Set_CAN3_RI1R(FLAG)                  (*(uint32_t*)0x400035c0 &= FLAG)
#define Clr_CAN3_RI1R(FLAG)                  (*(uint32_t*)0x400035c0 |= ~FLAG)
#define Set_CAN3_RDT1R(FLAG)                 (*(uint32_t*)0x400035c4 &= FLAG)
#define Clr_CAN3_RDT1R(FLAG)                 (*(uint32_t*)0x400035c4 |= ~FLAG)
#define Set_CAN3_RDL1R(FLAG)                 (*(uint32_t*)0x400035c8 &= FLAG)
#define Clr_CAN3_RDL1R(FLAG)                 (*(uint32_t*)0x400035c8 |= ~FLAG)
#define Set_CAN3_RDH1R(FLAG)                 (*(uint32_t*)0x400035cc &= FLAG)
#define Clr_CAN3_RDH1R(FLAG)                 (*(uint32_t*)0x400035cc |= ~FLAG)
#define Set_CAN3_FMR(FLAG)                   (*(uint32_t*)0x40003600 &= FLAG)
#define Clr_CAN3_FMR(FLAG)                   (*(uint32_t*)0x40003600 |= ~FLAG)
#define Set_CAN3_FM1R(FLAG)                  (*(uint32_t*)0x40003604 &= FLAG)
#define Clr_CAN3_FM1R(FLAG)                  (*(uint32_t*)0x40003604 |= ~FLAG)
#define Set_CAN3_FS1R(FLAG)                  (*(uint32_t*)0x4000360c &= FLAG)
#define Clr_CAN3_FS1R(FLAG)                  (*(uint32_t*)0x4000360c |= ~FLAG)
#define Set_CAN3_FFA1R(FLAG)                 (*(uint32_t*)0x40003614 &= FLAG)
#define Clr_CAN3_FFA1R(FLAG)                 (*(uint32_t*)0x40003614 |= ~FLAG)
#define Set_CAN3_FA1R(FLAG)                  (*(uint32_t*)0x4000361c &= FLAG)
#define Clr_CAN3_FA1R(FLAG)                  (*(uint32_t*)0x4000361c |= ~FLAG)
#define Set_CAN3_F0R1(FLAG)                  (*(uint32_t*)0x40003640 &= FLAG)
#define Clr_CAN3_F0R1(FLAG)                  (*(uint32_t*)0x40003640 |= ~FLAG)
#define Set_CAN3_F0R2(FLAG)                  (*(uint32_t*)0x40003644 &= FLAG)
#define Clr_CAN3_F0R2(FLAG)                  (*(uint32_t*)0x40003644 |= ~FLAG)
#define Set_CAN3_F1R1(FLAG)                  (*(uint32_t*)0x40003648 &= FLAG)
#define Clr_CAN3_F1R1(FLAG)                  (*(uint32_t*)0x40003648 |= ~FLAG)
#define Set_CAN3_F1R2(FLAG)                  (*(uint32_t*)0x4000364c &= FLAG)
#define Clr_CAN3_F1R2(FLAG)                  (*(uint32_t*)0x4000364c |= ~FLAG)
#define Set_CAN3_F2R1(FLAG)                  (*(uint32_t*)0x40003650 &= FLAG)
#define Clr_CAN3_F2R1(FLAG)                  (*(uint32_t*)0x40003650 |= ~FLAG)
#define Set_CAN3_F2R2(FLAG)                  (*(uint32_t*)0x40003654 &= FLAG)
#define Clr_CAN3_F2R2(FLAG)                  (*(uint32_t*)0x40003654 |= ~FLAG)
#define Set_CAN3_F3R1(FLAG)                  (*(uint32_t*)0x40003658 &= FLAG)
#define Clr_CAN3_F3R1(FLAG)                  (*(uint32_t*)0x40003658 |= ~FLAG)
#define Set_CAN3_F3R2(FLAG)                  (*(uint32_t*)0x4000365c &= FLAG)
#define Clr_CAN3_F3R2(FLAG)                  (*(uint32_t*)0x4000365c |= ~FLAG)
#define Set_CAN3_F4R1(FLAG)                  (*(uint32_t*)0x40003660 &= FLAG)
#define Clr_CAN3_F4R1(FLAG)                  (*(uint32_t*)0x40003660 |= ~FLAG)
#define Set_CAN3_F4R2(FLAG)                  (*(uint32_t*)0x40003664 &= FLAG)
#define Clr_CAN3_F4R2(FLAG)                  (*(uint32_t*)0x40003664 |= ~FLAG)
#define Set_CAN3_F5R1(FLAG)                  (*(uint32_t*)0x40003668 &= FLAG)
#define Clr_CAN3_F5R1(FLAG)                  (*(uint32_t*)0x40003668 |= ~FLAG)
#define Set_CAN3_F5R2(FLAG)                  (*(uint32_t*)0x4000366c &= FLAG)
#define Clr_CAN3_F5R2(FLAG)                  (*(uint32_t*)0x4000366c |= ~FLAG)
#define Set_CAN3_F6R1(FLAG)                  (*(uint32_t*)0x40003670 &= FLAG)
#define Clr_CAN3_F6R1(FLAG)                  (*(uint32_t*)0x40003670 |= ~FLAG)
#define Set_CAN3_F6R2(FLAG)                  (*(uint32_t*)0x40003674 &= FLAG)
#define Clr_CAN3_F6R2(FLAG)                  (*(uint32_t*)0x40003674 |= ~FLAG)
#define Set_CAN3_F7R1(FLAG)                  (*(uint32_t*)0x40003678 &= FLAG)
#define Clr_CAN3_F7R1(FLAG)                  (*(uint32_t*)0x40003678 |= ~FLAG)
#define Set_CAN3_F7R2(FLAG)                  (*(uint32_t*)0x4000367c &= FLAG)
#define Clr_CAN3_F7R2(FLAG)                  (*(uint32_t*)0x4000367c |= ~FLAG)
#define Set_CAN3_F8R1(FLAG)                  (*(uint32_t*)0x40003680 &= FLAG)
#define Clr_CAN3_F8R1(FLAG)                  (*(uint32_t*)0x40003680 |= ~FLAG)
#define Set_CAN3_F8R2(FLAG)                  (*(uint32_t*)0x40003684 &= FLAG)
#define Clr_CAN3_F8R2(FLAG)                  (*(uint32_t*)0x40003684 |= ~FLAG)
#define Set_CAN3_F9R1(FLAG)                  (*(uint32_t*)0x40003688 &= FLAG)
#define Clr_CAN3_F9R1(FLAG)                  (*(uint32_t*)0x40003688 |= ~FLAG)
#define Set_CAN3_F9R2(FLAG)                  (*(uint32_t*)0x4000368c &= FLAG)
#define Clr_CAN3_F9R2(FLAG)                  (*(uint32_t*)0x4000368c |= ~FLAG)
#define Set_CAN3_F10R1(FLAG)                 (*(uint32_t*)0x40003690 &= FLAG)
#define Clr_CAN3_F10R1(FLAG)                 (*(uint32_t*)0x40003690 |= ~FLAG)
#define Set_CAN3_F10R2(FLAG)                 (*(uint32_t*)0x40003694 &= FLAG)
#define Clr_CAN3_F10R2(FLAG)                 (*(uint32_t*)0x40003694 |= ~FLAG)
#define Set_CAN3_F11R1(FLAG)                 (*(uint32_t*)0x40003698 &= FLAG)
#define Clr_CAN3_F11R1(FLAG)                 (*(uint32_t*)0x40003698 |= ~FLAG)
#define Set_CAN3_F11R2(FLAG)                 (*(uint32_t*)0x4000369c &= FLAG)
#define Clr_CAN3_F11R2(FLAG)                 (*(uint32_t*)0x4000369c |= ~FLAG)
#define Set_CAN3_F12R1(FLAG)                 (*(uint32_t*)0x400036a0 &= FLAG)
#define Clr_CAN3_F12R1(FLAG)                 (*(uint32_t*)0x400036a0 |= ~FLAG)
#define Set_CAN3_F12R2(FLAG)                 (*(uint32_t*)0x400036a4 &= FLAG)
#define Clr_CAN3_F12R2(FLAG)                 (*(uint32_t*)0x400036a4 |= ~FLAG)
#define Set_CAN3_F13R1(FLAG)                 (*(uint32_t*)0x400036a8 &= FLAG)
#define Clr_CAN3_F13R1(FLAG)                 (*(uint32_t*)0x400036a8 |= ~FLAG)
#define Set_CAN3_F13R2(FLAG)                 (*(uint32_t*)0x400036ac &= FLAG)
#define Clr_CAN3_F13R2(FLAG)                 (*(uint32_t*)0x400036ac |= ~FLAG)
#define Set_CAN3_F14R1(FLAG)                 (*(uint32_t*)0x400036b0 &= FLAG)
#define Clr_CAN3_F14R1(FLAG)                 (*(uint32_t*)0x400036b0 |= ~FLAG)
#define Set_CAN3_F14R2(FLAG)                 (*(uint32_t*)0x400036b4 &= FLAG)
#define Clr_CAN3_F14R2(FLAG)                 (*(uint32_t*)0x400036b4 |= ~FLAG)
#define Set_CAN3_F15R1(FLAG)                 (*(uint32_t*)0x400036b8 &= FLAG)
#define Clr_CAN3_F15R1(FLAG)                 (*(uint32_t*)0x400036b8 |= ~FLAG)
#define Set_CAN3_F15R2(FLAG)                 (*(uint32_t*)0x400036bc &= FLAG)
#define Clr_CAN3_F15R2(FLAG)                 (*(uint32_t*)0x400036bc |= ~FLAG)
#define Set_CAN3_F16R1(FLAG)                 (*(uint32_t*)0x400036c0 &= FLAG)
#define Clr_CAN3_F16R1(FLAG)                 (*(uint32_t*)0x400036c0 |= ~FLAG)
#define Set_CAN3_F16R2(FLAG)                 (*(uint32_t*)0x400036c4 &= FLAG)
#define Clr_CAN3_F16R2(FLAG)                 (*(uint32_t*)0x400036c4 |= ~FLAG)
#define Set_CAN3_F17R1(FLAG)                 (*(uint32_t*)0x400036c8 &= FLAG)
#define Clr_CAN3_F17R1(FLAG)                 (*(uint32_t*)0x400036c8 |= ~FLAG)
#define Set_CAN3_F17R2(FLAG)                 (*(uint32_t*)0x400036cc &= FLAG)
#define Clr_CAN3_F17R2(FLAG)                 (*(uint32_t*)0x400036cc |= ~FLAG)
#define Set_CAN3_F18R1(FLAG)                 (*(uint32_t*)0x400036d0 &= FLAG)
#define Clr_CAN3_F18R1(FLAG)                 (*(uint32_t*)0x400036d0 |= ~FLAG)
#define Set_CAN3_F18R2(FLAG)                 (*(uint32_t*)0x400036d4 &= FLAG)
#define Clr_CAN3_F18R2(FLAG)                 (*(uint32_t*)0x400036d4 |= ~FLAG)
#define Set_CAN3_F19R1(FLAG)                 (*(uint32_t*)0x400036d8 &= FLAG)
#define Clr_CAN3_F19R1(FLAG)                 (*(uint32_t*)0x400036d8 |= ~FLAG)
#define Set_CAN3_F19R2(FLAG)                 (*(uint32_t*)0x400036dc &= FLAG)
#define Clr_CAN3_F19R2(FLAG)                 (*(uint32_t*)0x400036dc |= ~FLAG)
#define Set_CAN3_F20R1(FLAG)                 (*(uint32_t*)0x400036e0 &= FLAG)
#define Clr_CAN3_F20R1(FLAG)                 (*(uint32_t*)0x400036e0 |= ~FLAG)
#define Set_CAN3_F20R2(FLAG)                 (*(uint32_t*)0x400036e4 &= FLAG)
#define Clr_CAN3_F20R2(FLAG)                 (*(uint32_t*)0x400036e4 |= ~FLAG)
#define Set_CAN3_F21R1(FLAG)                 (*(uint32_t*)0x400036e8 &= FLAG)
#define Clr_CAN3_F21R1(FLAG)                 (*(uint32_t*)0x400036e8 |= ~FLAG)
#define Set_CAN3_F21R2(FLAG)                 (*(uint32_t*)0x400036ec &= FLAG)
#define Clr_CAN3_F21R2(FLAG)                 (*(uint32_t*)0x400036ec |= ~FLAG)
#define Set_CAN3_F22R1(FLAG)                 (*(uint32_t*)0x400036f0 &= FLAG)
#define Clr_CAN3_F22R1(FLAG)                 (*(uint32_t*)0x400036f0 |= ~FLAG)
#define Set_CAN3_F22R2(FLAG)                 (*(uint32_t*)0x400036f4 &= FLAG)
#define Clr_CAN3_F22R2(FLAG)                 (*(uint32_t*)0x400036f4 |= ~FLAG)
#define Set_CAN3_F23R1(FLAG)                 (*(uint32_t*)0x400036f8 &= FLAG)
#define Clr_CAN3_F23R1(FLAG)                 (*(uint32_t*)0x400036f8 |= ~FLAG)
#define Set_CAN3_F23R2(FLAG)                 (*(uint32_t*)0x400036fc &= FLAG)
#define Clr_CAN3_F23R2(FLAG)                 (*(uint32_t*)0x400036fc |= ~FLAG)
#define Set_CAN3_F24R1(FLAG)                 (*(uint32_t*)0x40003700 &= FLAG)
#define Clr_CAN3_F24R1(FLAG)                 (*(uint32_t*)0x40003700 |= ~FLAG)
#define Set_CAN3_F24R2(FLAG)                 (*(uint32_t*)0x40003704 &= FLAG)
#define Clr_CAN3_F24R2(FLAG)                 (*(uint32_t*)0x40003704 |= ~FLAG)
#define Set_CAN3_F25R1(FLAG)                 (*(uint32_t*)0x40003708 &= FLAG)
#define Clr_CAN3_F25R1(FLAG)                 (*(uint32_t*)0x40003708 |= ~FLAG)
#define Set_CAN3_F25R2(FLAG)                 (*(uint32_t*)0x4000370c &= FLAG)
#define Clr_CAN3_F25R2(FLAG)                 (*(uint32_t*)0x4000370c |= ~FLAG)
#define Set_CAN3_F26R1(FLAG)                 (*(uint32_t*)0x40003710 &= FLAG)
#define Clr_CAN3_F26R1(FLAG)                 (*(uint32_t*)0x40003710 |= ~FLAG)
#define Set_CAN3_F26R2(FLAG)                 (*(uint32_t*)0x40003714 &= FLAG)
#define Clr_CAN3_F26R2(FLAG)                 (*(uint32_t*)0x40003714 |= ~FLAG)
#define Set_CAN3_F27R1(FLAG)                 (*(uint32_t*)0x40003718 &= FLAG)
#define Clr_CAN3_F27R1(FLAG)                 (*(uint32_t*)0x40003718 |= ~FLAG)
#define Set_CAN3_F27R2(FLAG)                 (*(uint32_t*)0x4000371c &= FLAG)
#define Clr_CAN3_F27R2(FLAG)                 (*(uint32_t*)0x4000371c |= ~FLAG)
#define Set_CAN1_MCR(FLAG)                   (*(uint32_t*)0x40006400 &= FLAG)
#define Clr_CAN1_MCR(FLAG)                   (*(uint32_t*)0x40006400 |= ~FLAG)
#define Set_CAN1_MSR(FLAG)                   (*(uint32_t*)0x40006404 &= FLAG)
#define Clr_CAN1_MSR(FLAG)                   (*(uint32_t*)0x40006404 |= ~FLAG)
#define Set_CAN1_TSR(FLAG)                   (*(uint32_t*)0x40006408 &= FLAG)
#define Clr_CAN1_TSR(FLAG)                   (*(uint32_t*)0x40006408 |= ~FLAG)
#define Set_CAN1_RF0R(FLAG)                  (*(uint32_t*)0x4000640c &= FLAG)
#define Clr_CAN1_RF0R(FLAG)                  (*(uint32_t*)0x4000640c |= ~FLAG)
#define Set_CAN1_RF1R(FLAG)                  (*(uint32_t*)0x40006410 &= FLAG)
#define Clr_CAN1_RF1R(FLAG)                  (*(uint32_t*)0x40006410 |= ~FLAG)
#define Set_CAN1_IER(FLAG)                   (*(uint32_t*)0x40006414 &= FLAG)
#define Clr_CAN1_IER(FLAG)                   (*(uint32_t*)0x40006414 |= ~FLAG)
#define Set_CAN1_ESR(FLAG)                   (*(uint32_t*)0x40006418 &= FLAG)
#define Clr_CAN1_ESR(FLAG)                   (*(uint32_t*)0x40006418 |= ~FLAG)
#define Set_CAN1_BTR(FLAG)                   (*(uint32_t*)0x4000641c &= FLAG)
#define Clr_CAN1_BTR(FLAG)                   (*(uint32_t*)0x4000641c |= ~FLAG)
#define Set_CAN1_TI0R(FLAG)                  (*(uint32_t*)0x40006580 &= FLAG)
#define Clr_CAN1_TI0R(FLAG)                  (*(uint32_t*)0x40006580 |= ~FLAG)
#define Set_CAN1_TDT0R(FLAG)                 (*(uint32_t*)0x40006584 &= FLAG)
#define Clr_CAN1_TDT0R(FLAG)                 (*(uint32_t*)0x40006584 |= ~FLAG)
#define Set_CAN1_TDL0R(FLAG)                 (*(uint32_t*)0x40006588 &= FLAG)
#define Clr_CAN1_TDL0R(FLAG)                 (*(uint32_t*)0x40006588 |= ~FLAG)
#define Set_CAN1_TDH0R(FLAG)                 (*(uint32_t*)0x4000658c &= FLAG)
#define Clr_CAN1_TDH0R(FLAG)                 (*(uint32_t*)0x4000658c |= ~FLAG)
#define Set_CAN1_TI1R(FLAG)                  (*(uint32_t*)0x40006590 &= FLAG)
#define Clr_CAN1_TI1R(FLAG)                  (*(uint32_t*)0x40006590 |= ~FLAG)
#define Set_CAN1_TDT1R(FLAG)                 (*(uint32_t*)0x40006594 &= FLAG)
#define Clr_CAN1_TDT1R(FLAG)                 (*(uint32_t*)0x40006594 |= ~FLAG)
#define Set_CAN1_TDL1R(FLAG)                 (*(uint32_t*)0x40006598 &= FLAG)
#define Clr_CAN1_TDL1R(FLAG)                 (*(uint32_t*)0x40006598 |= ~FLAG)
#define Set_CAN1_TDH1R(FLAG)                 (*(uint32_t*)0x4000659c &= FLAG)
#define Clr_CAN1_TDH1R(FLAG)                 (*(uint32_t*)0x4000659c |= ~FLAG)
#define Set_CAN1_TI2R(FLAG)                  (*(uint32_t*)0x400065a0 &= FLAG)
#define Clr_CAN1_TI2R(FLAG)                  (*(uint32_t*)0x400065a0 |= ~FLAG)
#define Set_CAN1_TDT2R(FLAG)                 (*(uint32_t*)0x400065a4 &= FLAG)
#define Clr_CAN1_TDT2R(FLAG)                 (*(uint32_t*)0x400065a4 |= ~FLAG)
#define Set_CAN1_TDL2R(FLAG)                 (*(uint32_t*)0x400065a8 &= FLAG)
#define Clr_CAN1_TDL2R(FLAG)                 (*(uint32_t*)0x400065a8 |= ~FLAG)
#define Set_CAN1_TDH2R(FLAG)                 (*(uint32_t*)0x400065ac &= FLAG)
#define Clr_CAN1_TDH2R(FLAG)                 (*(uint32_t*)0x400065ac |= ~FLAG)
#define Set_CAN1_RI0R(FLAG)                  (*(uint32_t*)0x400065b0 &= FLAG)
#define Clr_CAN1_RI0R(FLAG)                  (*(uint32_t*)0x400065b0 |= ~FLAG)
#define Set_CAN1_RDT0R(FLAG)                 (*(uint32_t*)0x400065b4 &= FLAG)
#define Clr_CAN1_RDT0R(FLAG)                 (*(uint32_t*)0x400065b4 |= ~FLAG)
#define Set_CAN1_RDL0R(FLAG)                 (*(uint32_t*)0x400065b8 &= FLAG)
#define Clr_CAN1_RDL0R(FLAG)                 (*(uint32_t*)0x400065b8 |= ~FLAG)
#define Set_CAN1_RDH0R(FLAG)                 (*(uint32_t*)0x400065bc &= FLAG)
#define Clr_CAN1_RDH0R(FLAG)                 (*(uint32_t*)0x400065bc |= ~FLAG)
#define Set_CAN1_RI1R(FLAG)                  (*(uint32_t*)0x400065c0 &= FLAG)
#define Clr_CAN1_RI1R(FLAG)                  (*(uint32_t*)0x400065c0 |= ~FLAG)
#define Set_CAN1_RDT1R(FLAG)                 (*(uint32_t*)0x400065c4 &= FLAG)
#define Clr_CAN1_RDT1R(FLAG)                 (*(uint32_t*)0x400065c4 |= ~FLAG)
#define Set_CAN1_RDL1R(FLAG)                 (*(uint32_t*)0x400065c8 &= FLAG)
#define Clr_CAN1_RDL1R(FLAG)                 (*(uint32_t*)0x400065c8 |= ~FLAG)
#define Set_CAN1_RDH1R(FLAG)                 (*(uint32_t*)0x400065cc &= FLAG)
#define Clr_CAN1_RDH1R(FLAG)                 (*(uint32_t*)0x400065cc |= ~FLAG)
#define Set_CAN1_FMR(FLAG)                   (*(uint32_t*)0x40006600 &= FLAG)
#define Clr_CAN1_FMR(FLAG)                   (*(uint32_t*)0x40006600 |= ~FLAG)
#define Set_CAN1_FM1R(FLAG)                  (*(uint32_t*)0x40006604 &= FLAG)
#define Clr_CAN1_FM1R(FLAG)                  (*(uint32_t*)0x40006604 |= ~FLAG)
#define Set_CAN1_FS1R(FLAG)                  (*(uint32_t*)0x4000660c &= FLAG)
#define Clr_CAN1_FS1R(FLAG)                  (*(uint32_t*)0x4000660c |= ~FLAG)
#define Set_CAN1_FFA1R(FLAG)                 (*(uint32_t*)0x40006614 &= FLAG)
#define Clr_CAN1_FFA1R(FLAG)                 (*(uint32_t*)0x40006614 |= ~FLAG)
#define Set_CAN1_FA1R(FLAG)                  (*(uint32_t*)0x4000661c &= FLAG)
#define Clr_CAN1_FA1R(FLAG)                  (*(uint32_t*)0x4000661c |= ~FLAG)
#define Set_CAN1_F0R1(FLAG)                  (*(uint32_t*)0x40006640 &= FLAG)
#define Clr_CAN1_F0R1(FLAG)                  (*(uint32_t*)0x40006640 |= ~FLAG)
#define Set_CAN1_F0R2(FLAG)                  (*(uint32_t*)0x40006644 &= FLAG)
#define Clr_CAN1_F0R2(FLAG)                  (*(uint32_t*)0x40006644 |= ~FLAG)
#define Set_CAN1_F1R1(FLAG)                  (*(uint32_t*)0x40006648 &= FLAG)
#define Clr_CAN1_F1R1(FLAG)                  (*(uint32_t*)0x40006648 |= ~FLAG)
#define Set_CAN1_F1R2(FLAG)                  (*(uint32_t*)0x4000664c &= FLAG)
#define Clr_CAN1_F1R2(FLAG)                  (*(uint32_t*)0x4000664c |= ~FLAG)
#define Set_CAN1_F2R1(FLAG)                  (*(uint32_t*)0x40006650 &= FLAG)
#define Clr_CAN1_F2R1(FLAG)                  (*(uint32_t*)0x40006650 |= ~FLAG)
#define Set_CAN1_F2R2(FLAG)                  (*(uint32_t*)0x40006654 &= FLAG)
#define Clr_CAN1_F2R2(FLAG)                  (*(uint32_t*)0x40006654 |= ~FLAG)
#define Set_CAN1_F3R1(FLAG)                  (*(uint32_t*)0x40006658 &= FLAG)
#define Clr_CAN1_F3R1(FLAG)                  (*(uint32_t*)0x40006658 |= ~FLAG)
#define Set_CAN1_F3R2(FLAG)                  (*(uint32_t*)0x4000665c &= FLAG)
#define Clr_CAN1_F3R2(FLAG)                  (*(uint32_t*)0x4000665c |= ~FLAG)
#define Set_CAN1_F4R1(FLAG)                  (*(uint32_t*)0x40006660 &= FLAG)
#define Clr_CAN1_F4R1(FLAG)                  (*(uint32_t*)0x40006660 |= ~FLAG)
#define Set_CAN1_F4R2(FLAG)                  (*(uint32_t*)0x40006664 &= FLAG)
#define Clr_CAN1_F4R2(FLAG)                  (*(uint32_t*)0x40006664 |= ~FLAG)
#define Set_CAN1_F5R1(FLAG)                  (*(uint32_t*)0x40006668 &= FLAG)
#define Clr_CAN1_F5R1(FLAG)                  (*(uint32_t*)0x40006668 |= ~FLAG)
#define Set_CAN1_F5R2(FLAG)                  (*(uint32_t*)0x4000666c &= FLAG)
#define Clr_CAN1_F5R2(FLAG)                  (*(uint32_t*)0x4000666c |= ~FLAG)
#define Set_CAN1_F6R1(FLAG)                  (*(uint32_t*)0x40006670 &= FLAG)
#define Clr_CAN1_F6R1(FLAG)                  (*(uint32_t*)0x40006670 |= ~FLAG)
#define Set_CAN1_F6R2(FLAG)                  (*(uint32_t*)0x40006674 &= FLAG)
#define Clr_CAN1_F6R2(FLAG)                  (*(uint32_t*)0x40006674 |= ~FLAG)
#define Set_CAN1_F7R1(FLAG)                  (*(uint32_t*)0x40006678 &= FLAG)
#define Clr_CAN1_F7R1(FLAG)                  (*(uint32_t*)0x40006678 |= ~FLAG)
#define Set_CAN1_F7R2(FLAG)                  (*(uint32_t*)0x4000667c &= FLAG)
#define Clr_CAN1_F7R2(FLAG)                  (*(uint32_t*)0x4000667c |= ~FLAG)
#define Set_CAN1_F8R1(FLAG)                  (*(uint32_t*)0x40006680 &= FLAG)
#define Clr_CAN1_F8R1(FLAG)                  (*(uint32_t*)0x40006680 |= ~FLAG)
#define Set_CAN1_F8R2(FLAG)                  (*(uint32_t*)0x40006684 &= FLAG)
#define Clr_CAN1_F8R2(FLAG)                  (*(uint32_t*)0x40006684 |= ~FLAG)
#define Set_CAN1_F9R1(FLAG)                  (*(uint32_t*)0x40006688 &= FLAG)
#define Clr_CAN1_F9R1(FLAG)                  (*(uint32_t*)0x40006688 |= ~FLAG)
#define Set_CAN1_F9R2(FLAG)                  (*(uint32_t*)0x4000668c &= FLAG)
#define Clr_CAN1_F9R2(FLAG)                  (*(uint32_t*)0x4000668c |= ~FLAG)
#define Set_CAN1_F10R1(FLAG)                 (*(uint32_t*)0x40006690 &= FLAG)
#define Clr_CAN1_F10R1(FLAG)                 (*(uint32_t*)0x40006690 |= ~FLAG)
#define Set_CAN1_F10R2(FLAG)                 (*(uint32_t*)0x40006694 &= FLAG)
#define Clr_CAN1_F10R2(FLAG)                 (*(uint32_t*)0x40006694 |= ~FLAG)
#define Set_CAN1_F11R1(FLAG)                 (*(uint32_t*)0x40006698 &= FLAG)
#define Clr_CAN1_F11R1(FLAG)                 (*(uint32_t*)0x40006698 |= ~FLAG)
#define Set_CAN1_F11R2(FLAG)                 (*(uint32_t*)0x4000669c &= FLAG)
#define Clr_CAN1_F11R2(FLAG)                 (*(uint32_t*)0x4000669c |= ~FLAG)
#define Set_CAN1_F12R1(FLAG)                 (*(uint32_t*)0x400066a0 &= FLAG)
#define Clr_CAN1_F12R1(FLAG)                 (*(uint32_t*)0x400066a0 |= ~FLAG)
#define Set_CAN1_F12R2(FLAG)                 (*(uint32_t*)0x400066a4 &= FLAG)
#define Clr_CAN1_F12R2(FLAG)                 (*(uint32_t*)0x400066a4 |= ~FLAG)
#define Set_CAN1_F13R1(FLAG)                 (*(uint32_t*)0x400066a8 &= FLAG)
#define Clr_CAN1_F13R1(FLAG)                 (*(uint32_t*)0x400066a8 |= ~FLAG)
#define Set_CAN1_F13R2(FLAG)                 (*(uint32_t*)0x400066ac &= FLAG)
#define Clr_CAN1_F13R2(FLAG)                 (*(uint32_t*)0x400066ac |= ~FLAG)
#define Set_CAN1_F14R1(FLAG)                 (*(uint32_t*)0x400066b0 &= FLAG)
#define Clr_CAN1_F14R1(FLAG)                 (*(uint32_t*)0x400066b0 |= ~FLAG)
#define Set_CAN1_F14R2(FLAG)                 (*(uint32_t*)0x400066b4 &= FLAG)
#define Clr_CAN1_F14R2(FLAG)                 (*(uint32_t*)0x400066b4 |= ~FLAG)
#define Set_CAN1_F15R1(FLAG)                 (*(uint32_t*)0x400066b8 &= FLAG)
#define Clr_CAN1_F15R1(FLAG)                 (*(uint32_t*)0x400066b8 |= ~FLAG)
#define Set_CAN1_F15R2(FLAG)                 (*(uint32_t*)0x400066bc &= FLAG)
#define Clr_CAN1_F15R2(FLAG)                 (*(uint32_t*)0x400066bc |= ~FLAG)
#define Set_CAN1_F16R1(FLAG)                 (*(uint32_t*)0x400066c0 &= FLAG)
#define Clr_CAN1_F16R1(FLAG)                 (*(uint32_t*)0x400066c0 |= ~FLAG)
#define Set_CAN1_F16R2(FLAG)                 (*(uint32_t*)0x400066c4 &= FLAG)
#define Clr_CAN1_F16R2(FLAG)                 (*(uint32_t*)0x400066c4 |= ~FLAG)
#define Set_CAN1_F17R1(FLAG)                 (*(uint32_t*)0x400066c8 &= FLAG)
#define Clr_CAN1_F17R1(FLAG)                 (*(uint32_t*)0x400066c8 |= ~FLAG)
#define Set_CAN1_F17R2(FLAG)                 (*(uint32_t*)0x400066cc &= FLAG)
#define Clr_CAN1_F17R2(FLAG)                 (*(uint32_t*)0x400066cc |= ~FLAG)
#define Set_CAN1_F18R1(FLAG)                 (*(uint32_t*)0x400066d0 &= FLAG)
#define Clr_CAN1_F18R1(FLAG)                 (*(uint32_t*)0x400066d0 |= ~FLAG)
#define Set_CAN1_F18R2(FLAG)                 (*(uint32_t*)0x400066d4 &= FLAG)
#define Clr_CAN1_F18R2(FLAG)                 (*(uint32_t*)0x400066d4 |= ~FLAG)
#define Set_CAN1_F19R1(FLAG)                 (*(uint32_t*)0x400066d8 &= FLAG)
#define Clr_CAN1_F19R1(FLAG)                 (*(uint32_t*)0x400066d8 |= ~FLAG)
#define Set_CAN1_F19R2(FLAG)                 (*(uint32_t*)0x400066dc &= FLAG)
#define Clr_CAN1_F19R2(FLAG)                 (*(uint32_t*)0x400066dc |= ~FLAG)
#define Set_CAN1_F20R1(FLAG)                 (*(uint32_t*)0x400066e0 &= FLAG)
#define Clr_CAN1_F20R1(FLAG)                 (*(uint32_t*)0x400066e0 |= ~FLAG)
#define Set_CAN1_F20R2(FLAG)                 (*(uint32_t*)0x400066e4 &= FLAG)
#define Clr_CAN1_F20R2(FLAG)                 (*(uint32_t*)0x400066e4 |= ~FLAG)
#define Set_CAN1_F21R1(FLAG)                 (*(uint32_t*)0x400066e8 &= FLAG)
#define Clr_CAN1_F21R1(FLAG)                 (*(uint32_t*)0x400066e8 |= ~FLAG)
#define Set_CAN1_F21R2(FLAG)                 (*(uint32_t*)0x400066ec &= FLAG)
#define Clr_CAN1_F21R2(FLAG)                 (*(uint32_t*)0x400066ec |= ~FLAG)
#define Set_CAN1_F22R1(FLAG)                 (*(uint32_t*)0x400066f0 &= FLAG)
#define Clr_CAN1_F22R1(FLAG)                 (*(uint32_t*)0x400066f0 |= ~FLAG)
#define Set_CAN1_F22R2(FLAG)                 (*(uint32_t*)0x400066f4 &= FLAG)
#define Clr_CAN1_F22R2(FLAG)                 (*(uint32_t*)0x400066f4 |= ~FLAG)
#define Set_CAN1_F23R1(FLAG)                 (*(uint32_t*)0x400066f8 &= FLAG)
#define Clr_CAN1_F23R1(FLAG)                 (*(uint32_t*)0x400066f8 |= ~FLAG)
#define Set_CAN1_F23R2(FLAG)                 (*(uint32_t*)0x400066fc &= FLAG)
#define Clr_CAN1_F23R2(FLAG)                 (*(uint32_t*)0x400066fc |= ~FLAG)
#define Set_CAN1_F24R1(FLAG)                 (*(uint32_t*)0x40006700 &= FLAG)
#define Clr_CAN1_F24R1(FLAG)                 (*(uint32_t*)0x40006700 |= ~FLAG)
#define Set_CAN1_F24R2(FLAG)                 (*(uint32_t*)0x40006704 &= FLAG)
#define Clr_CAN1_F24R2(FLAG)                 (*(uint32_t*)0x40006704 |= ~FLAG)
#define Set_CAN1_F25R1(FLAG)                 (*(uint32_t*)0x40006708 &= FLAG)
