7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_CAN.h
#define Clr_CAN1_F25R1(FLAG)                 (*(uint32_t*)0x40006708 |= ~FLAG)
#define Set_CAN1_F25R2(FLAG)                 (*(uint32_t*)0x4000670c &= FLAG)
#define Clr_CAN1_F25R2(FLAG)                 (*(uint32_t*)0x4000670c |= ~FLAG)
#define Set_CAN1_F26R1(FLAG)                 (*(uint32_t*)0x40006710 &= FLAG)
#define Clr_CAN1_F26R1(FLAG)                 (*(uint32_t*)0x40006710 |= ~FLAG)
#define Set_CAN1_F26R2(FLAG)                 (*(uint32_t*)0x40006714 &= FLAG)
#define Clr_CAN1_F26R2(FLAG)                 (*(uint32_t*)0x40006714 |= ~FLAG)
#define Set_CAN1_F27R1(FLAG)                 (*(uint32_t*)0x40006718 &= FLAG)
#define Clr_CAN1_F27R1(FLAG)                 (*(uint32_t*)0x40006718 |= ~FLAG)
#define Set_CAN1_F27R2(FLAG)                 (*(uint32_t*)0x4000671c &= FLAG)
#define Clr_CAN1_F27R2(FLAG)                 (*(uint32_t*)0x4000671c |= ~FLAG)
#define Set_CAN2_MCR(FLAG)                   (*(uint32_t*)0x40006800 &= FLAG)
#define Clr_CAN2_MCR(FLAG)                   (*(uint32_t*)0x40006800 |= ~FLAG)
#define Set_CAN2_MSR(FLAG)                   (*(uint32_t*)0x40006804 &= FLAG)
#define Clr_CAN2_MSR(FLAG)                   (*(uint32_t*)0x40006804 |= ~FLAG)
#define Set_CAN2_TSR(FLAG)                   (*(uint32_t*)0x40006808 &= FLAG)
#define Clr_CAN2_TSR(FLAG)                   (*(uint32_t*)0x40006808 |= ~FLAG)
#define Set_CAN2_RF0R(FLAG)                  (*(uint32_t*)0x4000680c &= FLAG)
#define Clr_CAN2_RF0R(FLAG)                  (*(uint32_t*)0x4000680c |= ~FLAG)
#define Set_CAN2_RF1R(FLAG)                  (*(uint32_t*)0x40006810 &= FLAG)
#define Clr_CAN2_RF1R(FLAG)                  (*(uint32_t*)0x40006810 |= ~FLAG)
#define Set_CAN2_IER(FLAG)                   (*(uint32_t*)0x40006814 &= FLAG)
#define Clr_CAN2_IER(FLAG)                   (*(uint32_t*)0x40006814 |= ~FLAG)
#define Set_CAN2_ESR(FLAG)                   (*(uint32_t*)0x40006818 &= FLAG)
#define Clr_CAN2_ESR(FLAG)                   (*(uint32_t*)0x40006818 |= ~FLAG)
#define Set_CAN2_BTR(FLAG)                   (*(uint32_t*)0x4000681c &= FLAG)
#define Clr_CAN2_BTR(FLAG)                   (*(uint32_t*)0x4000681c |= ~FLAG)
#define Set_CAN2_TI0R(FLAG)                  (*(uint32_t*)0x40006980 &= FLAG)
#define Clr_CAN2_TI0R(FLAG)                  (*(uint32_t*)0x40006980 |= ~FLAG)
#define Set_CAN2_TDT0R(FLAG)                 (*(uint32_t*)0x40006984 &= FLAG)
#define Clr_CAN2_TDT0R(FLAG)                 (*(uint32_t*)0x40006984 |= ~FLAG)
#define Set_CAN2_TDL0R(FLAG)                 (*(uint32_t*)0x40006988 &= FLAG)
#define Clr_CAN2_TDL0R(FLAG)                 (*(uint32_t*)0x40006988 |= ~FLAG)
#define Set_CAN2_TDH0R(FLAG)                 (*(uint32_t*)0x4000698c &= FLAG)
#define Clr_CAN2_TDH0R(FLAG)                 (*(uint32_t*)0x4000698c |= ~FLAG)
#define Set_CAN2_TI1R(FLAG)                  (*(uint32_t*)0x40006990 &= FLAG)
#define Clr_CAN2_TI1R(FLAG)                  (*(uint32_t*)0x40006990 |= ~FLAG)
#define Set_CAN2_TDT1R(FLAG)                 (*(uint32_t*)0x40006994 &= FLAG)
#define Clr_CAN2_TDT1R(FLAG)                 (*(uint32_t*)0x40006994 |= ~FLAG)
#define Set_CAN2_TDL1R(FLAG)                 (*(uint32_t*)0x40006998 &= FLAG)
#define Clr_CAN2_TDL1R(FLAG)                 (*(uint32_t*)0x40006998 |= ~FLAG)
#define Set_CAN2_TDH1R(FLAG)                 (*(uint32_t*)0x4000699c &= FLAG)
#define Clr_CAN2_TDH1R(FLAG)                 (*(uint32_t*)0x4000699c |= ~FLAG)
#define Set_CAN2_TI2R(FLAG)                  (*(uint32_t*)0x400069a0 &= FLAG)
#define Clr_CAN2_TI2R(FLAG)                  (*(uint32_t*)0x400069a0 |= ~FLAG)
#define Set_CAN2_TDT2R(FLAG)                 (*(uint32_t*)0x400069a4 &= FLAG)
#define Clr_CAN2_TDT2R(FLAG)                 (*(uint32_t*)0x400069a4 |= ~FLAG)
#define Set_CAN2_TDL2R(FLAG)                 (*(uint32_t*)0x400069a8 &= FLAG)
#define Clr_CAN2_TDL2R(FLAG)                 (*(uint32_t*)0x400069a8 |= ~FLAG)
#define Set_CAN2_TDH2R(FLAG)                 (*(uint32_t*)0x400069ac &= FLAG)
#define Clr_CAN2_TDH2R(FLAG)                 (*(uint32_t*)0x400069ac |= ~FLAG)
#define Set_CAN2_RI0R(FLAG)                  (*(uint32_t*)0x400069b0 &= FLAG)
#define Clr_CAN2_RI0R(FLAG)                  (*(uint32_t*)0x400069b0 |= ~FLAG)
#define Set_CAN2_RDT0R(FLAG)                 (*(uint32_t*)0x400069b4 &= FLAG)
#define Clr_CAN2_RDT0R(FLAG)                 (*(uint32_t*)0x400069b4 |= ~FLAG)
#define Set_CAN2_RDL0R(FLAG)                 (*(uint32_t*)0x400069b8 &= FLAG)
#define Clr_CAN2_RDL0R(FLAG)                 (*(uint32_t*)0x400069b8 |= ~FLAG)
#define Set_CAN2_RDH0R(FLAG)                 (*(uint32_t*)0x400069bc &= FLAG)
#define Clr_CAN2_RDH0R(FLAG)                 (*(uint32_t*)0x400069bc |= ~FLAG)
#define Set_CAN2_RI1R(FLAG)                  (*(uint32_t*)0x400069c0 &= FLAG)
#define Clr_CAN2_RI1R(FLAG)                  (*(uint32_t*)0x400069c0 |= ~FLAG)
#define Set_CAN2_RDT1R(FLAG)                 (*(uint32_t*)0x400069c4 &= FLAG)
#define Clr_CAN2_RDT1R(FLAG)                 (*(uint32_t*)0x400069c4 |= ~FLAG)
#define Set_CAN2_RDL1R(FLAG)                 (*(uint32_t*)0x400069c8 &= FLAG)
#define Clr_CAN2_RDL1R(FLAG)                 (*(uint32_t*)0x400069c8 |= ~FLAG)
#define Set_CAN2_RDH1R(FLAG)                 (*(uint32_t*)0x400069cc &= FLAG)
#define Clr_CAN2_RDH1R(FLAG)                 (*(uint32_t*)0x400069cc |= ~FLAG)
#define Set_CAN2_FMR(FLAG)                   (*(uint32_t*)0x40006a00 &= FLAG)
#define Clr_CAN2_FMR(FLAG)                   (*(uint32_t*)0x40006a00 |= ~FLAG)
#define Set_CAN2_FM1R(FLAG)                  (*(uint32_t*)0x40006a04 &= FLAG)
#define Clr_CAN2_FM1R(FLAG)                  (*(uint32_t*)0x40006a04 |= ~FLAG)
#define Set_CAN2_FS1R(FLAG)                  (*(uint32_t*)0x40006a0c &= FLAG)
#define Clr_CAN2_FS1R(FLAG)                  (*(uint32_t*)0x40006a0c |= ~FLAG)
#define Set_CAN2_FFA1R(FLAG)                 (*(uint32_t*)0x40006a14 &= FLAG)
#define Clr_CAN2_FFA1R(FLAG)                 (*(uint32_t*)0x40006a14 |= ~FLAG)
#define Set_CAN2_FA1R(FLAG)                  (*(uint32_t*)0x40006a1c &= FLAG)
#define Clr_CAN2_FA1R(FLAG)                  (*(uint32_t*)0x40006a1c |= ~FLAG)
#define Set_CAN2_F0R1(FLAG)                  (*(uint32_t*)0x40006a40 &= FLAG)
#define Clr_CAN2_F0R1(FLAG)                  (*(uint32_t*)0x40006a40 |= ~FLAG)
#define Set_CAN2_F0R2(FLAG)                  (*(uint32_t*)0x40006a44 &= FLAG)
#define Clr_CAN2_F0R2(FLAG)                  (*(uint32_t*)0x40006a44 |= ~FLAG)
#define Set_CAN2_F1R1(FLAG)                  (*(uint32_t*)0x40006a48 &= FLAG)
#define Clr_CAN2_F1R1(FLAG)                  (*(uint32_t*)0x40006a48 |= ~FLAG)
#define Set_CAN2_F1R2(FLAG)                  (*(uint32_t*)0x40006a4c &= FLAG)
#define Clr_CAN2_F1R2(FLAG)                  (*(uint32_t*)0x40006a4c |= ~FLAG)
#define Set_CAN2_F2R1(FLAG)                  (*(uint32_t*)0x40006a50 &= FLAG)
#define Clr_CAN2_F2R1(FLAG)                  (*(uint32_t*)0x40006a50 |= ~FLAG)
#define Set_CAN2_F2R2(FLAG)                  (*(uint32_t*)0x40006a54 &= FLAG)
#define Clr_CAN2_F2R2(FLAG)                  (*(uint32_t*)0x40006a54 |= ~FLAG)
#define Set_CAN2_F3R1(FLAG)                  (*(uint32_t*)0x40006a58 &= FLAG)
#define Clr_CAN2_F3R1(FLAG)                  (*(uint32_t*)0x40006a58 |= ~FLAG)
#define Set_CAN2_F3R2(FLAG)                  (*(uint32_t*)0x40006a5c &= FLAG)
#define Clr_CAN2_F3R2(FLAG)                  (*(uint32_t*)0x40006a5c |= ~FLAG)
#define Set_CAN2_F4R1(FLAG)                  (*(uint32_t*)0x40006a60 &= FLAG)
#define Clr_CAN2_F4R1(FLAG)                  (*(uint32_t*)0x40006a60 |= ~FLAG)
#define Set_CAN2_F4R2(FLAG)                  (*(uint32_t*)0x40006a64 &= FLAG)
#define Clr_CAN2_F4R2(FLAG)                  (*(uint32_t*)0x40006a64 |= ~FLAG)
#define Set_CAN2_F5R1(FLAG)                  (*(uint32_t*)0x40006a68 &= FLAG)
#define Clr_CAN2_F5R1(FLAG)                  (*(uint32_t*)0x40006a68 |= ~FLAG)
#define Set_CAN2_F5R2(FLAG)                  (*(uint32_t*)0x40006a6c &= FLAG)
#define Clr_CAN2_F5R2(FLAG)                  (*(uint32_t*)0x40006a6c |= ~FLAG)
#define Set_CAN2_F6R1(FLAG)                  (*(uint32_t*)0x40006a70 &= FLAG)
#define Clr_CAN2_F6R1(FLAG)                  (*(uint32_t*)0x40006a70 |= ~FLAG)
#define Set_CAN2_F6R2(FLAG)                  (*(uint32_t*)0x40006a74 &= FLAG)
#define Clr_CAN2_F6R2(FLAG)                  (*(uint32_t*)0x40006a74 |= ~FLAG)
#define Set_CAN2_F7R1(FLAG)                  (*(uint32_t*)0x40006a78 &= FLAG)
#define Clr_CAN2_F7R1(FLAG)                  (*(uint32_t*)0x40006a78 |= ~FLAG)
#define Set_CAN2_F7R2(FLAG)                  (*(uint32_t*)0x40006a7c &= FLAG)
#define Clr_CAN2_F7R2(FLAG)                  (*(uint32_t*)0x40006a7c |= ~FLAG)
#define Set_CAN2_F8R1(FLAG)                  (*(uint32_t*)0x40006a80 &= FLAG)
#define Clr_CAN2_F8R1(FLAG)                  (*(uint32_t*)0x40006a80 |= ~FLAG)
#define Set_CAN2_F8R2(FLAG)                  (*(uint32_t*)0x40006a84 &= FLAG)
#define Clr_CAN2_F8R2(FLAG)                  (*(uint32_t*)0x40006a84 |= ~FLAG)
#define Set_CAN2_F9R1(FLAG)                  (*(uint32_t*)0x40006a88 &= FLAG)
#define Clr_CAN2_F9R1(FLAG)                  (*(uint32_t*)0x40006a88 |= ~FLAG)
#define Set_CAN2_F9R2(FLAG)                  (*(uint32_t*)0x40006a8c &= FLAG)
#define Clr_CAN2_F9R2(FLAG)                  (*(uint32_t*)0x40006a8c |= ~FLAG)
#define Set_CAN2_F10R1(FLAG)                 (*(uint32_t*)0x40006a90 &= FLAG)
#define Clr_CAN2_F10R1(FLAG)                 (*(uint32_t*)0x40006a90 |= ~FLAG)
#define Set_CAN2_F10R2(FLAG)                 (*(uint32_t*)0x40006a94 &= FLAG)
#define Clr_CAN2_F10R2(FLAG)                 (*(uint32_t*)0x40006a94 |= ~FLAG)
#define Set_CAN2_F11R1(FLAG)                 (*(uint32_t*)0x40006a98 &= FLAG)
#define Clr_CAN2_F11R1(FLAG)                 (*(uint32_t*)0x40006a98 |= ~FLAG)
#define Set_CAN2_F11R2(FLAG)                 (*(uint32_t*)0x40006a9c &= FLAG)
#define Clr_CAN2_F11R2(FLAG)                 (*(uint32_t*)0x40006a9c |= ~FLAG)
#define Set_CAN2_F12R1(FLAG)                 (*(uint32_t*)0x40006aa0 &= FLAG)
#define Clr_CAN2_F12R1(FLAG)                 (*(uint32_t*)0x40006aa0 |= ~FLAG)
#define Set_CAN2_F12R2(FLAG)                 (*(uint32_t*)0x40006aa4 &= FLAG)
#define Clr_CAN2_F12R2(FLAG)                 (*(uint32_t*)0x40006aa4 |= ~FLAG)
#define Set_CAN2_F13R1(FLAG)                 (*(uint32_t*)0x40006aa8 &= FLAG)
#define Clr_CAN2_F13R1(FLAG)                 (*(uint32_t*)0x40006aa8 |= ~FLAG)
#define Set_CAN2_F13R2(FLAG)                 (*(uint32_t*)0x40006aac &= FLAG)
#define Clr_CAN2_F13R2(FLAG)                 (*(uint32_t*)0x40006aac |= ~FLAG)
#define Set_CAN2_F14R1(FLAG)                 (*(uint32_t*)0x40006ab0 &= FLAG)
#define Clr_CAN2_F14R1(FLAG)                 (*(uint32_t*)0x40006ab0 |= ~FLAG)
#define Set_CAN2_F14R2(FLAG)                 (*(uint32_t*)0x40006ab4 &= FLAG)
#define Clr_CAN2_F14R2(FLAG)                 (*(uint32_t*)0x40006ab4 |= ~FLAG)
#define Set_CAN2_F15R1(FLAG)                 (*(uint32_t*)0x40006ab8 &= FLAG)
#define Clr_CAN2_F15R1(FLAG)                 (*(uint32_t*)0x40006ab8 |= ~FLAG)
#define Set_CAN2_F15R2(FLAG)                 (*(uint32_t*)0x40006abc &= FLAG)
#define Clr_CAN2_F15R2(FLAG)                 (*(uint32_t*)0x40006abc |= ~FLAG)
#define Set_CAN2_F16R1(FLAG)                 (*(uint32_t*)0x40006ac0 &= FLAG)
#define Clr_CAN2_F16R1(FLAG)                 (*(uint32_t*)0x40006ac0 |= ~FLAG)
#define Set_CAN2_F16R2(FLAG)                 (*(uint32_t*)0x40006ac4 &= FLAG)
#define Clr_CAN2_F16R2(FLAG)                 (*(uint32_t*)0x40006ac4 |= ~FLAG)
#define Set_CAN2_F17R1(FLAG)                 (*(uint32_t*)0x40006ac8 &= FLAG)
#define Clr_CAN2_F17R1(FLAG)                 (*(uint32_t*)0x40006ac8 |= ~FLAG)
#define Set_CAN2_F17R2(FLAG)                 (*(uint32_t*)0x40006acc &= FLAG)
#define Clr_CAN2_F17R2(FLAG)                 (*(uint32_t*)0x40006acc |= ~FLAG)
#define Set_CAN2_F18R1(FLAG)                 (*(uint32_t*)0x40006ad0 &= FLAG)
#define Clr_CAN2_F18R1(FLAG)                 (*(uint32_t*)0x40006ad0 |= ~FLAG)
#define Set_CAN2_F18R2(FLAG)                 (*(uint32_t*)0x40006ad4 &= FLAG)
#define Clr_CAN2_F18R2(FLAG)                 (*(uint32_t*)0x40006ad4 |= ~FLAG)
#define Set_CAN2_F19R1(FLAG)                 (*(uint32_t*)0x40006ad8 &= FLAG)
#define Clr_CAN2_F19R1(FLAG)                 (*(uint32_t*)0x40006ad8 |= ~FLAG)
#define Set_CAN2_F19R2(FLAG)                 (*(uint32_t*)0x40006adc &= FLAG)
#define Clr_CAN2_F19R2(FLAG)                 (*(uint32_t*)0x40006adc |= ~FLAG)
#define Set_CAN2_F20R1(FLAG)                 (*(uint32_t*)0x40006ae0 &= FLAG)
#define Clr_CAN2_F20R1(FLAG)                 (*(uint32_t*)0x40006ae0 |= ~FLAG)
#define Set_CAN2_F20R2(FLAG)                 (*(uint32_t*)0x40006ae4 &= FLAG)
#define Clr_CAN2_F20R2(FLAG)                 (*(uint32_t*)0x40006ae4 |= ~FLAG)
#define Set_CAN2_F21R1(FLAG)                 (*(uint32_t*)0x40006ae8 &= FLAG)
#define Clr_CAN2_F21R1(FLAG)                 (*(uint32_t*)0x40006ae8 |= ~FLAG)
#define Set_CAN2_F21R2(FLAG)                 (*(uint32_t*)0x40006aec &= FLAG)
#define Clr_CAN2_F21R2(FLAG)                 (*(uint32_t*)0x40006aec |= ~FLAG)
#define Set_CAN2_F22R1(FLAG)                 (*(uint32_t*)0x40006af0 &= FLAG)
#define Clr_CAN2_F22R1(FLAG)                 (*(uint32_t*)0x40006af0 |= ~FLAG)
#define Set_CAN2_F22R2(FLAG)                 (*(uint32_t*)0x40006af4 &= FLAG)
#define Clr_CAN2_F22R2(FLAG)                 (*(uint32_t*)0x40006af4 |= ~FLAG)
#define Set_CAN2_F23R1(FLAG)                 (*(uint32_t*)0x40006af8 &= FLAG)
#define Clr_CAN2_F23R1(FLAG)                 (*(uint32_t*)0x40006af8 |= ~FLAG)
#define Set_CAN2_F23R2(FLAG)                 (*(uint32_t*)0x40006afc &= FLAG)
#define Clr_CAN2_F23R2(FLAG)                 (*(uint32_t*)0x40006afc |= ~FLAG)
#define Set_CAN2_F24R1(FLAG)                 (*(uint32_t*)0x40006b00 &= FLAG)
#define Clr_CAN2_F24R1(FLAG)                 (*(uint32_t*)0x40006b00 |= ~FLAG)
#define Set_CAN2_F24R2(FLAG)                 (*(uint32_t*)0x40006b04 &= FLAG)
#define Clr_CAN2_F24R2(FLAG)                 (*(uint32_t*)0x40006b04 |= ~FLAG)
#define Set_CAN2_F25R1(FLAG)                 (*(uint32_t*)0x40006b08 &= FLAG)
#define Clr_CAN2_F25R1(FLAG)                 (*(uint32_t*)0x40006b08 |= ~FLAG)
#define Set_CAN2_F25R2(FLAG)                 (*(uint32_t*)0x40006b0c &= FLAG)
#define Clr_CAN2_F25R2(FLAG)                 (*(uint32_t*)0x40006b0c |= ~FLAG)
#define Set_CAN2_F26R1(FLAG)                 (*(uint32_t*)0x40006b10 &= FLAG)
#define Clr_CAN2_F26R1(FLAG)                 (*(uint32_t*)0x40006b10 |= ~FLAG)
#define Set_CAN2_F26R2(FLAG)                 (*(uint32_t*)0x40006b14 &= FLAG)
#define Clr_CAN2_F26R2(FLAG)                 (*(uint32_t*)0x40006b14 |= ~FLAG)
#define Set_CAN2_F27R1(FLAG)                 (*(uint32_t*)0x40006b18 &= FLAG)
#define Clr_CAN2_F27R1(FLAG)                 (*(uint32_t*)0x40006b18 |= ~FLAG)
#define Set_CAN2_F27R2(FLAG)                 (*(uint32_t*)0x40006b1c &= FLAG)
#define Clr_CAN2_F27R2(FLAG)                 (*(uint32_t*)0x40006b1c |= ~FLAG)
#define  _CAN3_MCR_DBF                                       (0x1 << 16)    // DBF
#define  _CAN3_MCR_RESET                                     (0x1 << 15)    // RESET
#define  _CAN3_MCR_TTCM                                      (0x1 << 7)    // TTCM
#define  _CAN3_MCR_ABOM                                      (0x1 << 6)    // ABOM
#define  _CAN3_MCR_AWUM                                      (0x1 << 5)    // AWUM
#define  _CAN3_MCR_NART                                      (0x1 << 4)    // NART
#define  _CAN3_MCR_RFLM                                      (0x1 << 3)    // RFLM
#define  _CAN3_MCR_TXFP                                      (0x1 << 2)    // TXFP
#define  _CAN3_MCR_SLEEP                                     (0x1 << 1)    // SLEEP
#define  _CAN3_MCR_INRQ                                      (0x1 << 0)    // INRQ
#define  _CAN3_MSR_RX                                        (0x1 << 11)    // RX
#define  _CAN3_MSR_SAMP                                      (0x1 << 10)    // SAMP
#define  _CAN3_MSR_RXM                                       (0x1 << 9)    // RXM
#define  _CAN3_MSR_TXM                                       (0x1 << 8)    // TXM
#define  _CAN3_MSR_SLAKI                                     (0x1 << 4)    // SLAKI
#define  _CAN3_MSR_WKUI                                      (0x1 << 3)    // WKUI
#define  _CAN3_MSR_ERRI                                      (0x1 << 2)    // ERRI
#define  _CAN3_MSR_SLAK                                      (0x1 << 1)    // SLAK
#define  _CAN3_MSR_INAK                                      (0x1 << 0)    // INAK
#define  _CAN3_TSR_LOW2                                      (0x1 << 31)    // Lowest priority flag for mailbox 2
#define  _CAN3_TSR_LOW1                                      (0x1 << 30)    // Lowest priority flag for mailbox 1
#define  _CAN3_TSR_LOW0                                      (0x1 << 29)    // Lowest priority flag for mailbox 0
#define  _CAN3_TSR_TME2                                      (0x1 << 28)    // Lowest priority flag for mailbox 2
#define  _CAN3_TSR_TME1                                      (0x1 << 27)    // Lowest priority flag for mailbox 1
#define  _CAN3_TSR_TME0                                      (0x1 << 26)    // Lowest priority flag for mailbox 0
#define  _CAN3_TSR_CODE                                      (0x3 << 24)    // CODE
#define  _CAN3_TSR_ABRQ2                                     (0x1 << 23)    // ABRQ2
#define  _CAN3_TSR_TERR2                                     (0x1 << 19)    // TERR2
#define  _CAN3_TSR_ALST2                                     (0x1 << 18)    // ALST2
#define  _CAN3_TSR_TXOK2                                     (0x1 << 17)    // TXOK2
#define  _CAN3_TSR_RQCP2                                     (0x1 << 16)    // RQCP2
#define  _CAN3_TSR_ABRQ1                                     (0x1 << 15)    // ABRQ1
#define  _CAN3_TSR_TERR1                                     (0x1 << 11)    // TERR1
#define  _CAN3_TSR_ALST1                                     (0x1 << 10)    // ALST1
#define  _CAN3_TSR_TXOK1                                     (0x1 << 9)    // TXOK1
#define  _CAN3_TSR_RQCP1                                     (0x1 << 8)    // RQCP1
#define  _CAN3_TSR_ABRQ0                                     (0x1 << 7)    // ABRQ0
#define  _CAN3_TSR_TERR0                                     (0x1 << 3)    // TERR0
#define  _CAN3_TSR_ALST0                                     (0x1 << 2)    // ALST0
#define  _CAN3_TSR_TXOK0                                     (0x1 << 1)    // TXOK0
#define  _CAN3_TSR_RQCP0                                     (0x1 << 0)    // RQCP0
#define  _CAN3_RF0R_RFOM0                                    (0x1 << 5)    // RFOM0
#define  _CAN3_RF0R_FOVR0                                    (0x1 << 4)    // FOVR0
#define  _CAN3_RF0R_FULL0                                    (0x1 << 3)    // FULL0
#define  _CAN3_RF0R_FMP0                                     (0x3 << 0)    // FMP0
#define  _CAN3_RF1R_RFOM1                                    (0x1 << 5)    // RFOM1
#define  _CAN3_RF1R_FOVR1                                    (0x1 << 4)    // FOVR1
#define  _CAN3_RF1R_FULL1                                    (0x1 << 3)    // FULL1
#define  _CAN3_RF1R_FMP1                                     (0x3 << 0)    // FMP1
#define  _CAN3_IER_SLKIE                                     (0x1 << 17)    // SLKIE
#define  _CAN3_IER_WKUIE                                     (0x1 << 16)    // WKUIE
#define  _CAN3_IER_ERRIE                                     (0x1 << 15)    // ERRIE
#define  _CAN3_IER_LECIE                                     (0x1 << 11)    // LECIE
#define  _CAN3_IER_BOFIE                                     (0x1 << 10)    // BOFIE
#define  _CAN3_IER_EPVIE                                     (0x1 << 9)    // EPVIE
#define  _CAN3_IER_EWGIE                                     (0x1 << 8)    // EWGIE
#define  _CAN3_IER_FOVIE1                                    (0x1 << 6)    // FOVIE1
#define  _CAN3_IER_FFIE1                                     (0x1 << 5)    // FFIE1
#define  _CAN3_IER_FMPIE1                                    (0x1 << 4)    // FMPIE1
#define  _CAN3_IER_FOVIE0                                    (0x1 << 3)    // FOVIE0
#define  _CAN3_IER_FFIE0                                     (0x1 << 2)    // FFIE0
#define  _CAN3_IER_FMPIE0                                    (0x1 << 1)    // FMPIE0
#define  _CAN3_IER_TMEIE                                     (0x1 << 0)    // TMEIE
#define  _CAN3_ESR_REC                                       (0xff << 24)    // REC
#define  _CAN3_ESR_TEC                                       (0xff << 16)    // TEC
#define  _CAN3_ESR_LEC                                       (0x7 << 4)    // LEC
#define  _CAN3_ESR_BOFF                                      (0x1 << 2)    // BOFF
#define  _CAN3_ESR_EPVF                                      (0x1 << 1)    // EPVF
#define  _CAN3_ESR_EWGF                                      (0x1 << 0)    // EWGF
#define  _CAN3_BTR_SILM                                      (0x1 << 31)    // SILM
#define  _CAN3_BTR_LBKM                                      (0x1 << 30)    // LBKM
#define  _CAN3_BTR_SJW                                       (0x3 << 24)    // SJW
#define  _CAN3_BTR_TS2                                       (0x7 << 20)    // TS2
#define  _CAN3_BTR_TS1                                       (0xf << 16)    // TS1
#define  _CAN3_BTR_BRP                                       (0x3ff << 0)    // BRP
#define  _CAN3_TI0R_STID                                     (0x7ff << 21)    // STID
#define  _CAN3_TI0R_EXID                                     (0x3ffff << 3)    // EXID
#define  _CAN3_TI0R_IDE                                      (0x1 << 2)    // IDE
#define  _CAN3_TI0R_RTR                                      (0x1 << 1)    // RTR
#define  _CAN3_TI0R_TXRQ                                     (0x1 << 0)    // TXRQ
#define  _CAN3_TDT0R_TIME                                    (0xffff << 16)    // TIME
#define  _CAN3_TDT0R_TGT                                     (0x1 << 8)    // TGT
#define  _CAN3_TDT0R_DLC                                     (0xf << 0)    // DLC
#define  _CAN3_TDL0R_DATA3                                   (0xff << 24)    // DATA3
#define  _CAN3_TDL0R_DATA2                                   (0xff << 16)    // DATA2
#define  _CAN3_TDL0R_DATA1                                   (0xff << 8)    // DATA1
#define  _CAN3_TDL0R_DATA0                                   (0xff << 0)    // DATA0
#define  _CAN3_TDH0R_DATA7                                   (0xff << 24)    // DATA7
#define  _CAN3_TDH0R_DATA6                                   (0xff << 16)    // DATA6
#define  _CAN3_TDH0R_DATA5                                   (0xff << 8)    // DATA5
#define  _CAN3_TDH0R_DATA4                                   (0xff << 0)    // DATA4
#define  _CAN3_TI1R_STID                                     (0x7ff << 21)    // STID
#define  _CAN3_TI1R_EXID                                     (0x3ffff << 3)    // EXID
#define  _CAN3_TI1R_IDE                                      (0x1 << 2)    // IDE
#define  _CAN3_TI1R_RTR                                      (0x1 << 1)    // RTR
#define  _CAN3_TI1R_TXRQ                                     (0x1 << 0)    // TXRQ
#define  _CAN3_TDT1R_TIME                                    (0xffff << 16)    // TIME
#define  _CAN3_TDT1R_TGT                                     (0x1 << 8)    // TGT
#define  _CAN3_TDT1R_DLC                                     (0xf << 0)    // DLC
#define  _CAN3_TDL1R_DATA3                                   (0xff << 24)    // DATA3
#define  _CAN3_TDL1R_DATA2                                   (0xff << 16)    // DATA2
#define  _CAN3_TDL1R_DATA1                                   (0xff << 8)    // DATA1
#define  _CAN3_TDL1R_DATA0                                   (0xff << 0)    // DATA0
#define  _CAN3_TDH1R_DATA7                                   (0xff << 24)    // DATA7
#define  _CAN3_TDH1R_DATA6                                   (0xff << 16)    // DATA6
#define  _CAN3_TDH1R_DATA5                                   (0xff << 8)    // DATA5
