7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_CAN.h
#define  _CAN3_F1R1_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F1R1_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F1R2_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F1R2_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F1R2_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F1R2_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F1R2_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F1R2_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F1R2_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F1R2_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F1R2_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F1R2_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F1R2_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F1R2_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F1R2_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F1R2_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F1R2_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F1R2_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F1R2_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F1R2_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F1R2_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F1R2_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F1R2_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F1R2_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F1R2_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F1R2_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F1R2_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F1R2_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F1R2_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F1R2_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F1R2_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F1R2_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F1R2_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F1R2_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F2R1_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F2R1_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F2R1_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F2R1_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F2R1_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F2R1_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F2R1_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F2R1_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F2R1_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F2R1_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F2R1_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F2R1_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F2R1_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F2R1_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F2R1_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F2R1_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F2R1_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F2R1_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F2R1_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F2R1_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F2R1_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F2R1_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F2R1_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F2R1_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F2R1_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F2R1_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F2R1_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F2R1_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F2R1_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F2R1_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F2R1_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F2R1_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F2R2_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F2R2_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F2R2_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F2R2_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F2R2_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F2R2_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F2R2_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F2R2_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F2R2_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F2R2_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F2R2_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F2R2_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F2R2_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F2R2_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F2R2_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F2R2_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F2R2_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F2R2_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F2R2_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F2R2_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F2R2_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F2R2_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F2R2_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F2R2_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F2R2_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F2R2_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F2R2_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F2R2_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F2R2_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F2R2_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F2R2_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F2R2_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F3R1_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F3R1_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F3R1_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F3R1_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F3R1_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F3R1_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F3R1_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F3R1_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F3R1_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F3R1_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F3R1_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F3R1_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F3R1_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F3R1_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F3R1_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F3R1_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F3R1_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F3R1_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F3R1_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F3R1_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F3R1_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F3R1_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F3R1_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F3R1_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F3R1_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F3R1_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F3R1_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F3R1_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F3R1_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F3R1_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F3R1_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F3R1_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F3R2_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F3R2_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F3R2_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F3R2_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F3R2_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F3R2_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F3R2_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F3R2_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F3R2_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F3R2_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F3R2_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F3R2_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F3R2_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F3R2_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F3R2_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F3R2_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F3R2_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F3R2_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F3R2_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F3R2_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F3R2_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F3R2_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F3R2_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F3R2_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F3R2_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F3R2_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F3R2_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F3R2_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F3R2_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F3R2_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F3R2_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F3R2_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F4R1_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F4R1_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F4R1_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F4R1_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F4R1_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F4R1_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F4R1_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F4R1_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F4R1_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F4R1_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F4R1_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F4R1_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F4R1_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F4R1_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F4R1_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F4R1_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F4R1_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F4R1_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F4R1_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F4R1_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F4R1_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F4R1_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F4R1_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F4R1_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F4R1_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F4R1_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F4R1_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F4R1_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F4R1_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F4R1_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F4R1_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F4R1_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F4R2_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F4R2_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F4R2_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F4R2_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F4R2_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F4R2_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F4R2_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F4R2_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F4R2_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F4R2_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F4R2_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F4R2_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F4R2_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F4R2_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F4R2_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F4R2_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F4R2_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F4R2_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F4R2_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F4R2_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F4R2_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F4R2_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F4R2_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F4R2_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F4R2_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F4R2_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F4R2_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F4R2_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F4R2_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F4R2_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F4R2_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F4R2_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F5R1_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F5R1_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F5R1_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F5R1_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F5R1_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F5R1_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN3_F5R1_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN3_F5R1_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN3_F5R1_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN3_F5R1_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN3_F5R1_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN3_F5R1_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN3_F5R1_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN3_F5R1_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN3_F5R1_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN3_F5R1_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN3_F5R1_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN3_F5R1_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN3_F5R1_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN3_F5R1_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN3_F5R1_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN3_F5R1_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN3_F5R1_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN3_F5R1_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN3_F5R1_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN3_F5R1_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN3_F5R1_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN3_F5R1_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN3_F5R1_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN3_F5R1_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN3_F5R1_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN3_F5R1_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN3_F5R2_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN3_F5R2_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN3_F5R2_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN3_F5R2_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN3_F5R2_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN3_F5R2_FB5                                      (0x1 << 5)    // Filter bits
