7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_CAN.h
#define  _CAN1_FM1R_FBM4                                     (0x1 << 4)    // Filter mode
#define  _CAN1_FM1R_FBM5                                     (0x1 << 5)    // Filter mode
#define  _CAN1_FM1R_FBM6                                     (0x1 << 6)    // Filter mode
#define  _CAN1_FM1R_FBM7                                     (0x1 << 7)    // Filter mode
#define  _CAN1_FM1R_FBM8                                     (0x1 << 8)    // Filter mode
#define  _CAN1_FM1R_FBM9                                     (0x1 << 9)    // Filter mode
#define  _CAN1_FM1R_FBM10                                    (0x1 << 10)    // Filter mode
#define  _CAN1_FM1R_FBM11                                    (0x1 << 11)    // Filter mode
#define  _CAN1_FM1R_FBM12                                    (0x1 << 12)    // Filter mode
#define  _CAN1_FM1R_FBM13                                    (0x1 << 13)    // Filter mode
#define  _CAN1_FM1R_FBM14                                    (0x1 << 14)    // Filter mode
#define  _CAN1_FM1R_FBM15                                    (0x1 << 15)    // Filter mode
#define  _CAN1_FM1R_FBM16                                    (0x1 << 16)    // Filter mode
#define  _CAN1_FM1R_FBM17                                    (0x1 << 17)    // Filter mode
#define  _CAN1_FM1R_FBM18                                    (0x1 << 18)    // Filter mode
#define  _CAN1_FM1R_FBM19                                    (0x1 << 19)    // Filter mode
#define  _CAN1_FM1R_FBM20                                    (0x1 << 20)    // Filter mode
#define  _CAN1_FM1R_FBM21                                    (0x1 << 21)    // Filter mode
#define  _CAN1_FM1R_FBM22                                    (0x1 << 22)    // Filter mode
#define  _CAN1_FM1R_FBM23                                    (0x1 << 23)    // Filter mode
#define  _CAN1_FM1R_FBM24                                    (0x1 << 24)    // Filter mode
#define  _CAN1_FM1R_FBM25                                    (0x1 << 25)    // Filter mode
#define  _CAN1_FM1R_FBM26                                    (0x1 << 26)    // Filter mode
#define  _CAN1_FM1R_FBM27                                    (0x1 << 27)    // Filter mode
#define  _CAN1_FS1R_FSC0                                     (0x1 << 0)    // Filter scale configuration
#define  _CAN1_FS1R_FSC1                                     (0x1 << 1)    // Filter scale configuration
#define  _CAN1_FS1R_FSC2                                     (0x1 << 2)    // Filter scale configuration
#define  _CAN1_FS1R_FSC3                                     (0x1 << 3)    // Filter scale configuration
#define  _CAN1_FS1R_FSC4                                     (0x1 << 4)    // Filter scale configuration
#define  _CAN1_FS1R_FSC5                                     (0x1 << 5)    // Filter scale configuration
#define  _CAN1_FS1R_FSC6                                     (0x1 << 6)    // Filter scale configuration
#define  _CAN1_FS1R_FSC7                                     (0x1 << 7)    // Filter scale configuration
#define  _CAN1_FS1R_FSC8                                     (0x1 << 8)    // Filter scale configuration
#define  _CAN1_FS1R_FSC9                                     (0x1 << 9)    // Filter scale configuration
#define  _CAN1_FS1R_FSC10                                    (0x1 << 10)    // Filter scale configuration
#define  _CAN1_FS1R_FSC11                                    (0x1 << 11)    // Filter scale configuration
#define  _CAN1_FS1R_FSC12                                    (0x1 << 12)    // Filter scale configuration
#define  _CAN1_FS1R_FSC13                                    (0x1 << 13)    // Filter scale configuration
#define  _CAN1_FS1R_FSC14                                    (0x1 << 14)    // Filter scale configuration
#define  _CAN1_FS1R_FSC15                                    (0x1 << 15)    // Filter scale configuration
#define  _CAN1_FS1R_FSC16                                    (0x1 << 16)    // Filter scale configuration
#define  _CAN1_FS1R_FSC17                                    (0x1 << 17)    // Filter scale configuration
#define  _CAN1_FS1R_FSC18                                    (0x1 << 18)    // Filter scale configuration
#define  _CAN1_FS1R_FSC19                                    (0x1 << 19)    // Filter scale configuration
#define  _CAN1_FS1R_FSC20                                    (0x1 << 20)    // Filter scale configuration
#define  _CAN1_FS1R_FSC21                                    (0x1 << 21)    // Filter scale configuration
#define  _CAN1_FS1R_FSC22                                    (0x1 << 22)    // Filter scale configuration
#define  _CAN1_FS1R_FSC23                                    (0x1 << 23)    // Filter scale configuration
#define  _CAN1_FS1R_FSC24                                    (0x1 << 24)    // Filter scale configuration
#define  _CAN1_FS1R_FSC25                                    (0x1 << 25)    // Filter scale configuration
#define  _CAN1_FS1R_FSC26                                    (0x1 << 26)    // Filter scale configuration
#define  _CAN1_FS1R_FSC27                                    (0x1 << 27)    // Filter scale configuration
#define  _CAN1_FFA1R_FFA0                                    (0x1 << 0)    // Filter FIFO assignment for filter 0
#define  _CAN1_FFA1R_FFA1                                    (0x1 << 1)    // Filter FIFO assignment for filter 1
#define  _CAN1_FFA1R_FFA2                                    (0x1 << 2)    // Filter FIFO assignment for filter 2
#define  _CAN1_FFA1R_FFA3                                    (0x1 << 3)    // Filter FIFO assignment for filter 3
#define  _CAN1_FFA1R_FFA4                                    (0x1 << 4)    // Filter FIFO assignment for filter 4
#define  _CAN1_FFA1R_FFA5                                    (0x1 << 5)    // Filter FIFO assignment for filter 5
#define  _CAN1_FFA1R_FFA6                                    (0x1 << 6)    // Filter FIFO assignment for filter 6
#define  _CAN1_FFA1R_FFA7                                    (0x1 << 7)    // Filter FIFO assignment for filter 7
#define  _CAN1_FFA1R_FFA8                                    (0x1 << 8)    // Filter FIFO assignment for filter 8
#define  _CAN1_FFA1R_FFA9                                    (0x1 << 9)    // Filter FIFO assignment for filter 9
#define  _CAN1_FFA1R_FFA10                                   (0x1 << 10)    // Filter FIFO assignment for filter 10
#define  _CAN1_FFA1R_FFA11                                   (0x1 << 11)    // Filter FIFO assignment for filter 11
#define  _CAN1_FFA1R_FFA12                                   (0x1 << 12)    // Filter FIFO assignment for filter 12
#define  _CAN1_FFA1R_FFA13                                   (0x1 << 13)    // Filter FIFO assignment for filter 13
#define  _CAN1_FFA1R_FFA14                                   (0x1 << 14)    // Filter FIFO assignment for filter 14
#define  _CAN1_FFA1R_FFA15                                   (0x1 << 15)    // Filter FIFO assignment for filter 15
#define  _CAN1_FFA1R_FFA16                                   (0x1 << 16)    // Filter FIFO assignment for filter 16
#define  _CAN1_FFA1R_FFA17                                   (0x1 << 17)    // Filter FIFO assignment for filter 17
#define  _CAN1_FFA1R_FFA18                                   (0x1 << 18)    // Filter FIFO assignment for filter 18
#define  _CAN1_FFA1R_FFA19                                   (0x1 << 19)    // Filter FIFO assignment for filter 19
#define  _CAN1_FFA1R_FFA20                                   (0x1 << 20)    // Filter FIFO assignment for filter 20
#define  _CAN1_FFA1R_FFA21                                   (0x1 << 21)    // Filter FIFO assignment for filter 21
#define  _CAN1_FFA1R_FFA22                                   (0x1 << 22)    // Filter FIFO assignment for filter 22
#define  _CAN1_FFA1R_FFA23                                   (0x1 << 23)    // Filter FIFO assignment for filter 23
#define  _CAN1_FFA1R_FFA24                                   (0x1 << 24)    // Filter FIFO assignment for filter 24
#define  _CAN1_FFA1R_FFA25                                   (0x1 << 25)    // Filter FIFO assignment for filter 25
#define  _CAN1_FFA1R_FFA26                                   (0x1 << 26)    // Filter FIFO assignment for filter 26
#define  _CAN1_FFA1R_FFA27                                   (0x1 << 27)    // Filter FIFO assignment for filter 27
#define  _CAN1_FA1R_FACT0                                    (0x1 << 0)    // Filter active
#define  _CAN1_FA1R_FACT1                                    (0x1 << 1)    // Filter active
#define  _CAN1_FA1R_FACT2                                    (0x1 << 2)    // Filter active
#define  _CAN1_FA1R_FACT3                                    (0x1 << 3)    // Filter active
#define  _CAN1_FA1R_FACT4                                    (0x1 << 4)    // Filter active
#define  _CAN1_FA1R_FACT5                                    (0x1 << 5)    // Filter active
#define  _CAN1_FA1R_FACT6                                    (0x1 << 6)    // Filter active
#define  _CAN1_FA1R_FACT7                                    (0x1 << 7)    // Filter active
#define  _CAN1_FA1R_FACT8                                    (0x1 << 8)    // Filter active
#define  _CAN1_FA1R_FACT9                                    (0x1 << 9)    // Filter active
#define  _CAN1_FA1R_FACT10                                   (0x1 << 10)    // Filter active
#define  _CAN1_FA1R_FACT11                                   (0x1 << 11)    // Filter active
#define  _CAN1_FA1R_FACT12                                   (0x1 << 12)    // Filter active
#define  _CAN1_FA1R_FACT13                                   (0x1 << 13)    // Filter active
#define  _CAN1_FA1R_FACT14                                   (0x1 << 14)    // Filter active
#define  _CAN1_FA1R_FACT15                                   (0x1 << 15)    // Filter active
#define  _CAN1_FA1R_FACT16                                   (0x1 << 16)    // Filter active
#define  _CAN1_FA1R_FACT17                                   (0x1 << 17)    // Filter active
#define  _CAN1_FA1R_FACT18                                   (0x1 << 18)    // Filter active
#define  _CAN1_FA1R_FACT19                                   (0x1 << 19)    // Filter active
#define  _CAN1_FA1R_FACT20                                   (0x1 << 20)    // Filter active
#define  _CAN1_FA1R_FACT21                                   (0x1 << 21)    // Filter active
#define  _CAN1_FA1R_FACT22                                   (0x1 << 22)    // Filter active
#define  _CAN1_FA1R_FACT23                                   (0x1 << 23)    // Filter active
#define  _CAN1_FA1R_FACT24                                   (0x1 << 24)    // Filter active
#define  _CAN1_FA1R_FACT25                                   (0x1 << 25)    // Filter active
#define  _CAN1_FA1R_FACT26                                   (0x1 << 26)    // Filter active
#define  _CAN1_FA1R_FACT27                                   (0x1 << 27)    // Filter active
#define  _CAN1_F0R1_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN1_F0R1_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN1_F0R1_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN1_F0R1_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN1_F0R1_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN1_F0R1_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN1_F0R1_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN1_F0R1_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN1_F0R1_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN1_F0R1_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN1_F0R1_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN1_F0R1_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN1_F0R1_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN1_F0R1_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN1_F0R1_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN1_F0R1_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN1_F0R1_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN1_F0R1_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN1_F0R1_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN1_F0R1_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN1_F0R1_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN1_F0R1_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN1_F0R1_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN1_F0R1_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN1_F0R1_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN1_F0R1_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN1_F0R1_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN1_F0R1_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN1_F0R1_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN1_F0R1_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN1_F0R1_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN1_F0R1_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN1_F0R2_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN1_F0R2_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN1_F0R2_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN1_F0R2_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN1_F0R2_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN1_F0R2_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN1_F0R2_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN1_F0R2_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN1_F0R2_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN1_F0R2_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN1_F0R2_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN1_F0R2_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN1_F0R2_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN1_F0R2_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN1_F0R2_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN1_F0R2_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN1_F0R2_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN1_F0R2_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN1_F0R2_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN1_F0R2_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN1_F0R2_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN1_F0R2_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN1_F0R2_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN1_F0R2_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN1_F0R2_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN1_F0R2_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN1_F0R2_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN1_F0R2_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN1_F0R2_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN1_F0R2_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN1_F0R2_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN1_F0R2_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN1_F1R1_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN1_F1R1_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN1_F1R1_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN1_F1R1_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN1_F1R1_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN1_F1R1_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN1_F1R1_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN1_F1R1_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN1_F1R1_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN1_F1R1_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN1_F1R1_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN1_F1R1_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN1_F1R1_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN1_F1R1_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN1_F1R1_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN1_F1R1_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN1_F1R1_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN1_F1R1_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN1_F1R1_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN1_F1R1_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN1_F1R1_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN1_F1R1_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN1_F1R1_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN1_F1R1_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN1_F1R1_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN1_F1R1_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN1_F1R1_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN1_F1R1_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN1_F1R1_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN1_F1R1_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN1_F1R1_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN1_F1R1_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN1_F1R2_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN1_F1R2_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN1_F1R2_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN1_F1R2_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN1_F1R2_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN1_F1R2_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN1_F1R2_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN1_F1R2_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN1_F1R2_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN1_F1R2_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN1_F1R2_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN1_F1R2_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN1_F1R2_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN1_F1R2_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN1_F1R2_FB14                                     (0x1 << 14)    // Filter bits
#define  _CAN1_F1R2_FB15                                     (0x1 << 15)    // Filter bits
#define  _CAN1_F1R2_FB16                                     (0x1 << 16)    // Filter bits
#define  _CAN1_F1R2_FB17                                     (0x1 << 17)    // Filter bits
#define  _CAN1_F1R2_FB18                                     (0x1 << 18)    // Filter bits
#define  _CAN1_F1R2_FB19                                     (0x1 << 19)    // Filter bits
#define  _CAN1_F1R2_FB20                                     (0x1 << 20)    // Filter bits
#define  _CAN1_F1R2_FB21                                     (0x1 << 21)    // Filter bits
#define  _CAN1_F1R2_FB22                                     (0x1 << 22)    // Filter bits
#define  _CAN1_F1R2_FB23                                     (0x1 << 23)    // Filter bits
#define  _CAN1_F1R2_FB24                                     (0x1 << 24)    // Filter bits
#define  _CAN1_F1R2_FB25                                     (0x1 << 25)    // Filter bits
#define  _CAN1_F1R2_FB26                                     (0x1 << 26)    // Filter bits
#define  _CAN1_F1R2_FB27                                     (0x1 << 27)    // Filter bits
#define  _CAN1_F1R2_FB28                                     (0x1 << 28)    // Filter bits
#define  _CAN1_F1R2_FB29                                     (0x1 << 29)    // Filter bits
#define  _CAN1_F1R2_FB30                                     (0x1 << 30)    // Filter bits
#define  _CAN1_F1R2_FB31                                     (0x1 << 31)    // Filter bits
#define  _CAN1_F2R1_FB0                                      (0x1 << 0)    // Filter bits
#define  _CAN1_F2R1_FB1                                      (0x1 << 1)    // Filter bits
#define  _CAN1_F2R1_FB2                                      (0x1 << 2)    // Filter bits
#define  _CAN1_F2R1_FB3                                      (0x1 << 3)    // Filter bits
#define  _CAN1_F2R1_FB4                                      (0x1 << 4)    // Filter bits
#define  _CAN1_F2R1_FB5                                      (0x1 << 5)    // Filter bits
#define  _CAN1_F2R1_FB6                                      (0x1 << 6)    // Filter bits
#define  _CAN1_F2R1_FB7                                      (0x1 << 7)    // Filter bits
#define  _CAN1_F2R1_FB8                                      (0x1 << 8)    // Filter bits
#define  _CAN1_F2R1_FB9                                      (0x1 << 9)    // Filter bits
#define  _CAN1_F2R1_FB10                                     (0x1 << 10)    // Filter bits
#define  _CAN1_F2R1_FB11                                     (0x1 << 11)    // Filter bits
#define  _CAN1_F2R1_FB12                                     (0x1 << 12)    // Filter bits
#define  _CAN1_F2R1_FB13                                     (0x1 << 13)    // Filter bits
#define  _CAN1_F2R1_FB14                                     (0x1 << 14)    // Filter bits
