7h3qu1rkyb1t/stm32f7-drivers/drivers/inc/stm32f767xx_CAN.h
#define  _CAN1_F26R2_FB31                                    (0x1 << 31)    // Filter bits
#define  _CAN1_F27R1_FB0                                     (0x1 << 0)    // Filter bits
#define  _CAN1_F27R1_FB1                                     (0x1 << 1)    // Filter bits
#define  _CAN1_F27R1_FB2                                     (0x1 << 2)    // Filter bits
#define  _CAN1_F27R1_FB3                                     (0x1 << 3)    // Filter bits
#define  _CAN1_F27R1_FB4                                     (0x1 << 4)    // Filter bits
#define  _CAN1_F27R1_FB5                                     (0x1 << 5)    // Filter bits
#define  _CAN1_F27R1_FB6                                     (0x1 << 6)    // Filter bits
#define  _CAN1_F27R1_FB7                                     (0x1 << 7)    // Filter bits
#define  _CAN1_F27R1_FB8                                     (0x1 << 8)    // Filter bits
#define  _CAN1_F27R1_FB9                                     (0x1 << 9)    // Filter bits
#define  _CAN1_F27R1_FB10                                    (0x1 << 10)    // Filter bits
#define  _CAN1_F27R1_FB11                                    (0x1 << 11)    // Filter bits
#define  _CAN1_F27R1_FB12                                    (0x1 << 12)    // Filter bits
#define  _CAN1_F27R1_FB13                                    (0x1 << 13)    // Filter bits
#define  _CAN1_F27R1_FB14                                    (0x1 << 14)    // Filter bits
#define  _CAN1_F27R1_FB15                                    (0x1 << 15)    // Filter bits
#define  _CAN1_F27R1_FB16                                    (0x1 << 16)    // Filter bits
#define  _CAN1_F27R1_FB17                                    (0x1 << 17)    // Filter bits
#define  _CAN1_F27R1_FB18                                    (0x1 << 18)    // Filter bits
#define  _CAN1_F27R1_FB19                                    (0x1 << 19)    // Filter bits
#define  _CAN1_F27R1_FB20                                    (0x1 << 20)    // Filter bits
#define  _CAN1_F27R1_FB21                                    (0x1 << 21)    // Filter bits
#define  _CAN1_F27R1_FB22                                    (0x1 << 22)    // Filter bits
#define  _CAN1_F27R1_FB23                                    (0x1 << 23)    // Filter bits
#define  _CAN1_F27R1_FB24                                    (0x1 << 24)    // Filter bits
#define  _CAN1_F27R1_FB25                                    (0x1 << 25)    // Filter bits
#define  _CAN1_F27R1_FB26                                    (0x1 << 26)    // Filter bits
#define  _CAN1_F27R1_FB27                                    (0x1 << 27)    // Filter bits
#define  _CAN1_F27R1_FB28                                    (0x1 << 28)    // Filter bits
#define  _CAN1_F27R1_FB29                                    (0x1 << 29)    // Filter bits
#define  _CAN1_F27R1_FB30                                    (0x1 << 30)    // Filter bits
#define  _CAN1_F27R1_FB31                                    (0x1 << 31)    // Filter bits
#define  _CAN1_F27R2_FB0                                     (0x1 << 0)    // Filter bits
#define  _CAN1_F27R2_FB1                                     (0x1 << 1)    // Filter bits
#define  _CAN1_F27R2_FB2                                     (0x1 << 2)    // Filter bits
#define  _CAN1_F27R2_FB3                                     (0x1 << 3)    // Filter bits
#define  _CAN1_F27R2_FB4                                     (0x1 << 4)    // Filter bits
#define  _CAN1_F27R2_FB5                                     (0x1 << 5)    // Filter bits
#define  _CAN1_F27R2_FB6                                     (0x1 << 6)    // Filter bits
#define  _CAN1_F27R2_FB7                                     (0x1 << 7)    // Filter bits
#define  _CAN1_F27R2_FB8                                     (0x1 << 8)    // Filter bits
#define  _CAN1_F27R2_FB9                                     (0x1 << 9)    // Filter bits
#define  _CAN1_F27R2_FB10                                    (0x1 << 10)    // Filter bits
#define  _CAN1_F27R2_FB11                                    (0x1 << 11)    // Filter bits
#define  _CAN1_F27R2_FB12                                    (0x1 << 12)    // Filter bits
#define  _CAN1_F27R2_FB13                                    (0x1 << 13)    // Filter bits
#define  _CAN1_F27R2_FB14                                    (0x1 << 14)    // Filter bits
#define  _CAN1_F27R2_FB15                                    (0x1 << 15)    // Filter bits
#define  _CAN1_F27R2_FB16                                    (0x1 << 16)    // Filter bits
#define  _CAN1_F27R2_FB17                                    (0x1 << 17)    // Filter bits
#define  _CAN1_F27R2_FB18                                    (0x1 << 18)    // Filter bits
#define  _CAN1_F27R2_FB19                                    (0x1 << 19)    // Filter bits
#define  _CAN1_F27R2_FB20                                    (0x1 << 20)    // Filter bits
#define  _CAN1_F27R2_FB21                                    (0x1 << 21)    // Filter bits
#define  _CAN1_F27R2_FB22                                    (0x1 << 22)    // Filter bits
#define  _CAN1_F27R2_FB23                                    (0x1 << 23)    // Filter bits
#define  _CAN1_F27R2_FB24                                    (0x1 << 24)    // Filter bits
#define  _CAN1_F27R2_FB25                                    (0x1 << 25)    // Filter bits
#define  _CAN1_F27R2_FB26                                    (0x1 << 26)    // Filter bits
#define  _CAN1_F27R2_FB27                                    (0x1 << 27)    // Filter bits
#define  _CAN1_F27R2_FB28                                    (0x1 << 28)    // Filter bits
#define  _CAN1_F27R2_FB29                                    (0x1 << 29)    // Filter bits
#define  _CAN1_F27R2_FB30                                    (0x1 << 30)    // Filter bits
#define  _CAN1_F27R2_FB31                                    (0x1 << 31)    // Filter bits
#define  _CAN2_MCR_DBF                                       (0x1 << 16)    // DBF
#define  _CAN2_MCR_RESET                                     (0x1 << 15)    // RESET
#define  _CAN2_MCR_TTCM                                      (0x1 << 7)    // TTCM
#define  _CAN2_MCR_ABOM                                      (0x1 << 6)    // ABOM
#define  _CAN2_MCR_AWUM                                      (0x1 << 5)    // AWUM
#define  _CAN2_MCR_NART                                      (0x1 << 4)    // NART
#define  _CAN2_MCR_RFLM                                      (0x1 << 3)    // RFLM
#define  _CAN2_MCR_TXFP                                      (0x1 << 2)    // TXFP
#define  _CAN2_MCR_SLEEP                                     (0x1 << 1)    // SLEEP
#define  _CAN2_MCR_INRQ                                      (0x1 << 0)    // INRQ
#define  _CAN2_MSR_RX                                        (0x1 << 11)    // RX
#define  _CAN2_MSR_SAMP                                      (0x1 << 10)    // SAMP
#define  _CAN2_MSR_RXM                                       (0x1 << 9)    // RXM
#define  _CAN2_MSR_TXM                                       (0x1 << 8)    // TXM
#define  _CAN2_MSR_SLAKI                                     (0x1 << 4)    // SLAKI
#define  _CAN2_MSR_WKUI                                      (0x1 << 3)    // WKUI
#define  _CAN2_MSR_ERRI                                      (0x1 << 2)    // ERRI
#define  _CAN2_MSR_SLAK                                      (0x1 << 1)    // SLAK
#define  _CAN2_MSR_INAK                                      (0x1 << 0)    // INAK
#define  _CAN2_TSR_LOW2                                      (0x1 << 31)    // Lowest priority flag for mailbox 2
#define  _CAN2_TSR_LOW1                                      (0x1 << 30)    // Lowest priority flag for mailbox 1
#define  _CAN2_TSR_LOW0                                      (0x1 << 29)    // Lowest priority flag for mailbox 0
#define  _CAN2_TSR_TME2                                      (0x1 << 28)    // Lowest priority flag for mailbox 2
#define  _CAN2_TSR_TME1                                      (0x1 << 27)    // Lowest priority flag for mailbox 1
#define  _CAN2_TSR_TME0                                      (0x1 << 26)    // Lowest priority flag for mailbox 0
#define  _CAN2_TSR_CODE                                      (0x3 << 24)    // CODE
#define  _CAN2_TSR_ABRQ2                                     (0x1 << 23)    // ABRQ2
#define  _CAN2_TSR_TERR2                                     (0x1 << 19)    // TERR2
#define  _CAN2_TSR_ALST2                                     (0x1 << 18)    // ALST2
#define  _CAN2_TSR_TXOK2                                     (0x1 << 17)    // TXOK2
#define  _CAN2_TSR_RQCP2                                     (0x1 << 16)    // RQCP2
#define  _CAN2_TSR_ABRQ1                                     (0x1 << 15)    // ABRQ1
#define  _CAN2_TSR_TERR1                                     (0x1 << 11)    // TERR1
#define  _CAN2_TSR_ALST1                                     (0x1 << 10)    // ALST1
#define  _CAN2_TSR_TXOK1                                     (0x1 << 9)    // TXOK1
#define  _CAN2_TSR_RQCP1                                     (0x1 << 8)    // RQCP1
#define  _CAN2_TSR_ABRQ0                                     (0x1 << 7)    // ABRQ0
#define  _CAN2_TSR_TERR0                                     (0x1 << 3)    // TERR0
#define  _CAN2_TSR_ALST0                                     (0x1 << 2)    // ALST0
#define  _CAN2_TSR_TXOK0                                     (0x1 << 1)    // TXOK0
#define  _CAN2_TSR_RQCP0                                     (0x1 << 0)    // RQCP0
#define  _CAN2_RF0R_RFOM0                                    (0x1 << 5)    // RFOM0
#define  _CAN2_RF0R_FOVR0                                    (0x1 << 4)    // FOVR0
#define  _CAN2_RF0R_FULL0                                    (0x1 << 3)    // FULL0
#define  _CAN2_RF0R_FMP0                                     (0x3 << 0)    // FMP0
#define  _CAN2_RF1R_RFOM1                                    (0x1 << 5)    // RFOM1
#define  _CAN2_RF1R_FOVR1                                    (0x1 << 4)    // FOVR1
#define  _CAN2_RF1R_FULL1                                    (0x1 << 3)    // FULL1
#define  _CAN2_RF1R_FMP1                                     (0x3 << 0)    // FMP1
#define  _CAN2_IER_SLKIE                                     (0x1 << 17)    // SLKIE
#define  _CAN2_IER_WKUIE                                     (0x1 << 16)    // WKUIE
#define  _CAN2_IER_ERRIE                                     (0x1 << 15)    // ERRIE
#define  _CAN2_IER_LECIE                                     (0x1 << 11)    // LECIE
#define  _CAN2_IER_BOFIE                                     (0x1 << 10)    // BOFIE
#define  _CAN2_IER_EPVIE                                     (0x1 << 9)    // EPVIE
#define  _CAN2_IER_EWGIE                                     (0x1 << 8)    // EWGIE
#define  _CAN2_IER_FOVIE1                                    (0x1 << 6)    // FOVIE1
#define  _CAN2_IER_FFIE1                                     (0x1 << 5)    // FFIE1
#define  _CAN2_IER_FMPIE1                                    (0x1 << 4)    // FMPIE1
#define  _CAN2_IER_FOVIE0                                    (0x1 << 3)    // FOVIE0
#define  _CAN2_IER_FFIE0                                     (0x1 << 2)    // FFIE0
#define  _CAN2_IER_FMPIE0                                    (0x1 << 1)    // FMPIE0
#define  _CAN2_IER_TMEIE                                     (0x1 << 0)    // TMEIE
#define  _CAN2_ESR_REC                                       (0xff << 24)    // REC
#define  _CAN2_ESR_TEC                                       (0xff << 16)    // TEC
#define  _CAN2_ESR_LEC                                       (0x7 << 4)    // LEC
#define  _CAN2_ESR_BOFF                                      (0x1 << 2)    // BOFF
#define  _CAN2_ESR_EPVF                                      (0x1 << 1)    // EPVF
#define  _CAN2_ESR_EWGF                                      (0x1 << 0)    // EWGF
#define  _CAN2_BTR_SILM                                      (0x1 << 31)    // SILM
#define  _CAN2_BTR_LBKM                                      (0x1 << 30)    // LBKM
#define  _CAN2_BTR_SJW                                       (0x3 << 24)    // SJW
#define  _CAN2_BTR_TS2                                       (0x7 << 20)    // TS2
#define  _CAN2_BTR_TS1                                       (0xf << 16)    // TS1
#define  _CAN2_BTR_BRP                                       (0x3ff << 0)    // BRP
#define  _CAN2_TI0R_STID                                     (0x7ff << 21)    // STID
#define  _CAN2_TI0R_EXID                                     (0x3ffff << 3)    // EXID
#define  _CAN2_TI0R_IDE                                      (0x1 << 2)    // IDE
#define  _CAN2_TI0R_RTR                                      (0x1 << 1)    // RTR
#define  _CAN2_TI0R_TXRQ                                     (0x1 << 0)    // TXRQ
#define  _CAN2_TDT0R_TIME                                    (0xffff << 16)    // TIME
#define  _CAN2_TDT0R_TGT                                     (0x1 << 8)    // TGT
#define  _CAN2_TDT0R_DLC                                     (0xf << 0)    // DLC
#define  _CAN2_TDL0R_DATA3                                   (0xff << 24)    // DATA3
#define  _CAN2_TDL0R_DATA2                                   (0xff << 16)    // DATA2
#define  _CAN2_TDL0R_DATA1                                   (0xff << 8)    // DATA1
#define  _CAN2_TDL0R_DATA0                                   (0xff << 0)    // DATA0
#define  _CAN2_TDH0R_DATA7                                   (0xff << 24)    // DATA7
#define  _CAN2_TDH0R_DATA6                                   (0xff << 16)    // DATA6
#define  _CAN2_TDH0R_DATA5                                   (0xff << 8)    // DATA5
#define  _CAN2_TDH0R_DATA4                                   (0xff << 0)    // DATA4
#define  _CAN2_TI1R_STID                                     (0x7ff << 21)    // STID
#define  _CAN2_TI1R_EXID                                     (0x3ffff << 3)    // EXID
#define  _CAN2_TI1R_IDE                                      (0x1 << 2)    // IDE
#define  _CAN2_TI1R_RTR                                      (0x1 << 1)    // RTR
#define  _CAN2_TI1R_TXRQ                                     (0x1 << 0)    // TXRQ
#define  _CAN2_TDT1R_TIME                                    (0xffff << 16)    // TIME
#define  _CAN2_TDT1R_TGT                                     (0x1 << 8)    // TGT
#define  _CAN2_TDT1R_DLC                                     (0xf << 0)    // DLC
#define  _CAN2_TDL1R_DATA3                                   (0xff << 24)    // DATA3
#define  _CAN2_TDL1R_DATA2                                   (0xff << 16)    // DATA2
#define  _CAN2_TDL1R_DATA1                                   (0xff << 8)    // DATA1
#define  _CAN2_TDL1R_DATA0                                   (0xff << 0)    // DATA0
#define  _CAN2_TDH1R_DATA7                                   (0xff << 24)    // DATA7
#define  _CAN2_TDH1R_DATA6                                   (0xff << 16)    // DATA6
#define  _CAN2_TDH1R_DATA5                                   (0xff << 8)    // DATA5
#define  _CAN2_TDH1R_DATA4                                   (0xff << 0)    // DATA4
#define  _CAN2_TI2R_STID                                     (0x7ff << 21)    // STID
#define  _CAN2_TI2R_EXID                                     (0x3ffff << 3)    // EXID
#define  _CAN2_TI2R_IDE                                      (0x1 << 2)    // IDE
#define  _CAN2_TI2R_RTR                                      (0x1 << 1)    // RTR
#define  _CAN2_TI2R_TXRQ                                     (0x1 << 0)    // TXRQ
#define  _CAN2_TDT2R_TIME                                    (0xffff << 16)    // TIME
#define  _CAN2_TDT2R_TGT                                     (0x1 << 8)    // TGT
#define  _CAN2_TDT2R_DLC                                     (0xf << 0)    // DLC
#define  _CAN2_TDL2R_DATA3                                   (0xff << 24)    // DATA3
#define  _CAN2_TDL2R_DATA2                                   (0xff << 16)    // DATA2
#define  _CAN2_TDL2R_DATA1                                   (0xff << 8)    // DATA1
#define  _CAN2_TDL2R_DATA0                                   (0xff << 0)    // DATA0
#define  _CAN2_TDH2R_DATA7                                   (0xff << 24)    // DATA7
#define  _CAN2_TDH2R_DATA6                                   (0xff << 16)    // DATA6
#define  _CAN2_TDH2R_DATA5                                   (0xff << 8)    // DATA5
#define  _CAN2_TDH2R_DATA4                                   (0xff << 0)    // DATA4
#define  _CAN2_RI0R_STID                                     (0x7ff << 21)    // STID
#define  _CAN2_RI0R_EXID                                     (0x3ffff << 3)    // EXID
#define  _CAN2_RI0R_IDE                                      (0x1 << 2)    // IDE
#define  _CAN2_RI0R_RTR                                      (0x1 << 1)    // RTR
#define  _CAN2_RDT0R_TIME                                    (0xffff << 16)    // TIME
#define  _CAN2_RDT0R_FMI                                     (0xff << 8)    // FMI
#define  _CAN2_RDT0R_DLC                                     (0xf << 0)    // DLC
#define  _CAN2_RDL0R_DATA3                                   (0xff << 24)    // DATA3
#define  _CAN2_RDL0R_DATA2                                   (0xff << 16)    // DATA2
#define  _CAN2_RDL0R_DATA1                                   (0xff << 8)    // DATA1
#define  _CAN2_RDL0R_DATA0                                   (0xff << 0)    // DATA0
#define  _CAN2_RDH0R_DATA7                                   (0xff << 24)    // DATA7
#define  _CAN2_RDH0R_DATA6                                   (0xff << 16)    // DATA6
#define  _CAN2_RDH0R_DATA5                                   (0xff << 8)    // DATA5
#define  _CAN2_RDH0R_DATA4                                   (0xff << 0)    // DATA4
#define  _CAN2_RI1R_STID                                     (0x7ff << 21)    // STID
#define  _CAN2_RI1R_EXID                                     (0x3ffff << 3)    // EXID
#define  _CAN2_RI1R_IDE                                      (0x1 << 2)    // IDE
#define  _CAN2_RI1R_RTR                                      (0x1 << 1)    // RTR
#define  _CAN2_RDT1R_TIME                                    (0xffff << 16)    // TIME
#define  _CAN2_RDT1R_FMI                                     (0xff << 8)    // FMI
#define  _CAN2_RDT1R_DLC                                     (0xf << 0)    // DLC
#define  _CAN2_RDL1R_DATA3                                   (0xff << 24)    // DATA3
#define  _CAN2_RDL1R_DATA2                                   (0xff << 16)    // DATA2
#define  _CAN2_RDL1R_DATA1                                   (0xff << 8)    // DATA1
#define  _CAN2_RDL1R_DATA0                                   (0xff << 0)    // DATA0
#define  _CAN2_RDH1R_DATA7                                   (0xff << 24)    // DATA7
#define  _CAN2_RDH1R_DATA6                                   (0xff << 16)    // DATA6
#define  _CAN2_RDH1R_DATA5                                   (0xff << 8)    // DATA5
#define  _CAN2_RDH1R_DATA4                                   (0xff << 0)    // DATA4
#define  _CAN2_FMR_CAN2SB                                    (0x3f << 8)    // CAN2SB
#define  _CAN2_FMR_FINIT                                     (0x1 << 0)    // FINIT
#define  _CAN2_FM1R_FBM0                                     (0x1 << 0)    // Filter mode
#define  _CAN2_FM1R_FBM1                                     (0x1 << 1)    // Filter mode
#define  _CAN2_FM1R_FBM2                                     (0x1 << 2)    // Filter mode
#define  _CAN2_FM1R_FBM3                                     (0x1 << 3)    // Filter mode
#define  _CAN2_FM1R_FBM4                                     (0x1 << 4)    // Filter mode
#define  _CAN2_FM1R_FBM5                                     (0x1 << 5)    // Filter mode
#define  _CAN2_FM1R_FBM6                                     (0x1 << 6)    // Filter mode
#define  _CAN2_FM1R_FBM7                                     (0x1 << 7)    // Filter mode
#define  _CAN2_FM1R_FBM8                                     (0x1 << 8)    // Filter mode
#define  _CAN2_FM1R_FBM9                                     (0x1 << 9)    // Filter mode
#define  _CAN2_FM1R_FBM10                                    (0x1 << 10)    // Filter mode
#define  _CAN2_FM1R_FBM11                                    (0x1 << 11)    // Filter mode
#define  _CAN2_FM1R_FBM12                                    (0x1 << 12)    // Filter mode
#define  _CAN2_FM1R_FBM13                                    (0x1 << 13)    // Filter mode
#define  _CAN2_FM1R_FBM14                                    (0x1 << 14)    // Filter mode
#define  _CAN2_FM1R_FBM15                                    (0x1 << 15)    // Filter mode
#define  _CAN2_FM1R_FBM16                                    (0x1 << 16)    // Filter mode
#define  _CAN2_FM1R_FBM17                                    (0x1 << 17)    // Filter mode
#define  _CAN2_FM1R_FBM18                                    (0x1 << 18)    // Filter mode
#define  _CAN2_FM1R_FBM19                                    (0x1 << 19)    // Filter mode
#define  _CAN2_FM1R_FBM20                                    (0x1 << 20)    // Filter mode
#define  _CAN2_FM1R_FBM21                                    (0x1 << 21)    // Filter mode
#define  _CAN2_FM1R_FBM22                                    (0x1 << 22)    // Filter mode
#define  _CAN2_FM1R_FBM23                                    (0x1 << 23)    // Filter mode
#define  _CAN2_FM1R_FBM24                                    (0x1 << 24)    // Filter mode
#define  _CAN2_FM1R_FBM25                                    (0x1 << 25)    // Filter mode
#define  _CAN2_FM1R_FBM26                                    (0x1 << 26)    // Filter mode
#define  _CAN2_FM1R_FBM27                                    (0x1 << 27)    // Filter mode
#define  _CAN2_FS1R_FSC0                                     (0x1 << 0)    // Filter scale configuration
#define  _CAN2_FS1R_FSC1                                     (0x1 << 1)    // Filter scale configuration
#define  _CAN2_FS1R_FSC2                                     (0x1 << 2)    // Filter scale configuration
#define  _CAN2_FS1R_FSC3                                     (0x1 << 3)    // Filter scale configuration
#define  _CAN2_FS1R_FSC4                                     (0x1 << 4)    // Filter scale configuration
#define  _CAN2_FS1R_FSC5                                     (0x1 << 5)    // Filter scale configuration
#define  _CAN2_FS1R_FSC6                                     (0x1 << 6)    // Filter scale configuration
#define  _CAN2_FS1R_FSC7                                     (0x1 << 7)    // Filter scale configuration
#define  _CAN2_FS1R_FSC8                                     (0x1 << 8)    // Filter scale configuration
#define  _CAN2_FS1R_FSC9                                     (0x1 << 9)    // Filter scale configuration
#define  _CAN2_FS1R_FSC10                                    (0x1 << 10)    // Filter scale configuration
#define  _CAN2_FS1R_FSC11                                    (0x1 << 11)    // Filter scale configuration
#define  _CAN2_FS1R_FSC12                                    (0x1 << 12)    // Filter scale configuration
#define  _CAN2_FS1R_FSC13                                    (0x1 << 13)    // Filter scale configuration
#define  _CAN2_FS1R_FSC14                                    (0x1 << 14)    // Filter scale configuration
#define  _CAN2_FS1R_FSC15                                    (0x1 << 15)    // Filter scale configuration
#define  _CAN2_FS1R_FSC16                                    (0x1 << 16)    // Filter scale configuration
#define  _CAN2_FS1R_FSC17                                    (0x1 << 17)    // Filter scale configuration
#define  _CAN2_FS1R_FSC18                                    (0x1 << 18)    // Filter scale configuration
#define  _CAN2_FS1R_FSC19                                    (0x1 << 19)    // Filter scale configuration
#define  _CAN2_FS1R_FSC20                                    (0x1 << 20)    // Filter scale configuration
